hosein282/esp32_relex/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino.cpp
# 1 "C:\\Users\\Amin\\AppData\\Local\\Temp\\tmph0upj4ee"
#include <Arduino.h>
# 1 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
#include <LittleFS.h>
#include "base64.hpp"


#define TINY_GSM_MODEM_SIM800 

#define DEVICE_MODEL "G84-TR"

const short VERSION = 2;

#include <WiFi.h>
#include <ESPmDNS.h>
#include <TinyGsmClient.h>
#include <WiFiClientSecure.h>
#define SerialAT Serial2

const char mci_apn[] = "mcinet";
const char irancell_apn[] = "mtnirancell ";
const char other_apn[] = "internet";
const char gprsUser[] = "";
const char gprsPass[] = "";

TinyGsm modem(SerialAT);


#include "hex.h"
#include <ESPAsyncWebServer.h>

#include <HTTPUpdate.h>
#include "index.h"


#include <ArduinoJson.h>
#include <HardwareSerial.h>
#include <esp_task_wdt.h>


#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>

#define SCREEN_WIDTH 128
#define SCREEN_HEIGHT 64


#define OLED_RESET -1
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);


#include <Preferences.h>
Preferences EEPROM;


#include <Ticker.h>
#include <ESP32Time.h>

#include <PubSubClient.h>

const char *mqtt_server = "broker.emqx.io";



WiFiClient wifiClient;

TinyGsmClient gsmClient(modem);

Client *activeClient = nullptr;
PubSubClient mqtt;
uint port = 1883;



#include "time.h"

#include <OneWire.h>
#include <DallasTemperature.h>

const uint8_t oneWireBus = 23;

OneWire oneWire(oneWireBus);


DallasTemperature sensors(&oneWire);


#include <RCSwitch.h>
RCSwitch mySwitch = RCSwitch();



const char *ssid_ap = "RELEX-";
String ssid = "";
String password = "";
String mac = "";
String m_server = "5.238.178.210";
String sub_topic = "action";
String pub_topic = "report";


const char *wifi_ssid = "/ssid.txt";
const char *wifi_pass = "/password.txt";
const char *m_server_k = "/server.txt";
const char *mac_f = "/mac.txt";


const uint8_t totalPhoneNo = 5;
const uint8_t totalPwm = 2;
const uint8_t totalOutputs = 6;
const uint8_t totalInputs = 2;
const uint8_t totalRemotes = 48;
const uint8_t totalTemps = 3;
const uint8_t totalAnalogs = 2;
const uint8_t totalScenarios = 16;

enum MQTT_NET
{
  OFF = 0,
  WIFI = 1,
  GPRS = 2,
};
MQTT_NET mqttNet = OFF;

uint8_t signalQuality = 0;
uint8_t wifiTryCount = 0;



char *TCI_CHARGE = "AT+CUSD=1,\"*140*11#\"";
char *IRANCEL_CHARGE = "AT+CUSD=1,\"*140*121#\"";
char *RIGHTEL_CHARGE = "AT+CUSD=1,\"*140*121#\"";

struct Task
{
  unsigned long executeAt;
  void (*function)();
};

#define MAX_TASKS 10
Task taskQueue[MAX_TASKS];
int taskCount = 0;
#define WINDOW_SIZE 6

struct analog
{
  float value;
  float avg;
  float buffer[WINDOW_SIZE];
};
struct output
{
  char labelKey[5];
  char timerKey[5];
  uint8_t gpio;
  boolean state;
  String label;
  String timer;
  uint8_t pwm;
  uint8_t type;
  unsigned long now;
  uint16_t time;
  boolean locked;
  int chain[totalOutputs];
};

struct Scenario
{
  char key[4];
  String value;
  int8_t input;
  String condition;
  float threshold;
  int8_t outPin;
  int8_t outState;
  uint8_t swType;
  uint8_t notif;
  unsigned long lastNotif;
};
struct Input
{
  char labelKey[4];
  char key[4];
  String label;
  float voltage;
  uint8_t state;
  uint8_t gpio;
  unsigned long lastTrigger;
  float avg;
  float buffer[WINDOW_SIZE];
};

int scenariosCount = 0;

Scenario scenarios[totalScenarios] = {};

String phoneNo[totalPhoneNo] = {"", "", "", "", ""};

int8_t toggleTimers[8] = {-1, -1, -1, -1, -1, -1, -1, -1};

Input inputs[totalInputs] = {
    {"il3", "in3", "", 0.0, 0, 34, 0, 0.0, {}},
    {"il4", "in4", "", 0.0, 0, 35, 0, 0.0, {}}};

Input analogInputs[totalAnalogs] = {
    {"al1", "a1", "", 0.0, 0, 36, 0, 0.0, {}},
    {"al2", "a2", "", 0.0, 0, 39, 0, 0.0, {}}};

output outputs[totalOutputs] = {
    {"lab1", "sch1", 26, 0, "", "", 0, 0, 0},
    {"lab2", "sch2", 15, 0, "", "", 0, 0, 0},
    {"lab3", "sch3", 32, 0, "", "", 0, 0, 0},
    {"lab4", "sch4", 27, 0, "", "", 0, 0, 0},
    {"lab5", "sch5", 14, 0, "", "", 0, 0, 0},
    {"lab6", "sch6", 19, 0, "", "", 0, 0, 0}};

output pwms[totalPwm] = {
    {"pwm1", "pS1", 13, 1, "", "", 0},
    {"pwm2", "pS2", 18, 1, "", "", 0}};

analog temps[totalTemps] = {};
analog currentAmp = {0.0, 0.0, {}};

const char *offsetPhone[totalPhoneNo] = {"p1", "p2", "p3", "p4", "p5"};

const char *offsetStates = "states";

uint minCounter = 0;
String tempLabel = "";
String tempPhone = "";
String tempSch = "";

unsigned int deviceYear = 0;

String op = "";
String buffer;

#define MQTT_MAX_PACKET_SIZE 1024
#define SCH_TASK_TIME 60000
unsigned int aResolution = 4095;
const int freq = 3000;

unsigned int analog_read_threshold = 500;
float temp_threshold = 1.0;
uint8_t signal_threshold = 2;
uint8_t TEMP_THRESHOLD_BIAS = 3.0;
uint8_t THRESHOLD_BIAS = 204;

unsigned long prevCallTime = 0;
unsigned long prevTaskTime = 0;
unsigned long prevRfTime = 0;



AsyncWebServer server(80);
AsyncEventSource events("/events");



const char *ntpServer = "pool.ntp.org";
const long gmtOffset_sec = 12600;
const int daylightOffset_sec = 0;

unsigned long Epoch_Time;



Ticker flipper;


ESP32Time rtc(0);



#define SHORT_PRESS_TIME 2000
#define LONG_PRESS_TIME 5000
#define VERY_LONG_TIME 8000
#define SUPER_LONG_TIME 12000
#define MQTT_REPORT_INTERVAL 3000



#define rxPin 16
#define txPin 17






#define BUTTON_PIN 33
#include <Bounce2.h>
Bounce2::Button button = Bounce2::Button();

#define RESET_GSM 25



#define STATUS_LED 2

String outStates = "";
String inStates = "";
String pwmStates = "";






String smsStatus, senderNumber, receivedDate, msg, date = "";
boolean smsIsReady = false;



boolean DEBUG_MODE = 1;


bool hasGSM = false;
bool hasWifi = false;
bool forceUseGprs = false;
bool gprsConnected = false;
bool mqtt_connected = false;
bool callOnAlert = true;
bool securityMode = false;
bool notifyScenarios = true;
bool alerting = false;
unsigned int remoteCount = 0;

unsigned long now = millis();
unsigned long lastTrigger = 0;







const char *PARAM_INPUT_1 = "output";
const char *PARAM_INPUT_2 = "state";
const char *PARAM_INPUT_3 = "timer";
const char *PARAM_INPUT_4 = "label";
const char *PARAM_INPUT_5 = "pwm";

uint count = 0;

unsigned long pressedTime = 0;
unsigned long releasedTime = 0;
unsigned long previousMillis = 0;
String processor(const String &var);
void callback(char *topic, byte *payload, unsigned int length);
void reconnect();
void initLittleFS();
bool initWiFi();
void setupLCD();
void welcomeDisplay();
void initDisplay();
void updateDisplay();
void updateSignalDisp();
void updateOperatorDisp();
void updateStatesDSP();
void updateTempDSP();
void loadingDisplay(int progress, String title);
void alertDisplay();
void alertEnableDisplay();
void updatedDisplay();
void smsDisplay();
void clearSmsDisplay();
void reloadDisplay();
void displayRemoteRg(String remote, unsigned long time);
void displayRemoteDel(String remote, unsigned long time);
void setup();
void loop();
void processTasks();
void checkRelayTimes();
void switchRelay(uint8_t index, bool state, uint16_t time, bool isLocked);
void runScenarios();
void notifHexSms(int index, String phone);
void setupVariables();
bool processScenarios(String command, uint8_t index);
void handlePostRequest(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total);
void initWifiAp();
String getMAC();
bool printLocalTime();
void setTimezone(String timezone);
void resetWifi();
String createDateString(const struct tm &timeinfo, int timezoneOffset);
boolean TimePeriodIsOver(unsigned long &periodStartTime, unsigned long TimePeriod);
void publishReport(const char *payload);
void checkSensors();
void readAnalogs();
void checkRfRemote();
void readButton();
void handleShortPress();
void handleRemoteRegister();
void saveRemoteCode(const char *code, uint16_t out);
void handleRemoveRemote();
void removeAllRemotes();
void removeRemoteCode(const char *code);
void compareRemote(String received);
void initSim800Mqtt();
void setupGSM();
void manageMqttConnection();
void checkMqttStatus();
String SendShortCommand(String command, String response);
String WaitForResponse(String response);
bool checkSim();
void getOperator(bool report);
void getSignalQuality(bool report);
void blinkLed();
void GsmReset();
void checkOutputSch(uint8_t input);
String addScenario(String val);
void removeScenario(const char *key);
void readyForSms();
void receiveSms();
void getGsmDateTime();
void parseData(String buff);
void extractUssd(String buff);
void readSerial();
bool isRegistered();
void extractSms(String buff);
void updateDate(String dateTime);
void checkHourTasks();
void checkSmsHistory();
void checkTasks();
void setAverageElement();
void createMovingAverage();
void saveLastRelayStates();
void sendMqttFeedback();
void setPwm(uint8_t index, uint8_t percent);
void clearTimer(uint8_t index);
void doAction(String phoneNumber);
void clearSmsVariables();
String outputIsBusy(uint8_t index);
void Reply(String text, String Phone);
void ReplyHex(String text, String Phone);
void ForwardHex(String text, String Phone);
void callAdmin(int index);
void hangUp();
void answerCall();
void writeToEEPROM(const char *addrOffset, const String &strToWrite);
void writeIntToEEPROM(const char *addrOffset, unsigned int value);
void writeDateTimeEEPROM(const char *addrOffset, const String &strToWrite);
String readFromEEPROM(const char *addrOffset);
int readIntFromEEPROM(const char *addrOffset);
boolean comparePhone(String number);
void flip();
void debugPrint(String text);
String createOutArray();
String createPwmArray();
String createInArray();
String createSettingArray();
String prepareData();
String mqttPeresence();
String createTimersArray();
String createScenariosArray();
String createChainsArray();
String prepareDbData(String event);
String prepareDbLog(String event);
String prepareTimersData();
String prepareSync();
String prepareSMSStats();
void checkUpdate(String firmwareUrl);
void update_progress(int cur, int total);
String arrayToString(int arr[]);
void stringToArray(String str, int arr[]);
#line 350 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
String processor(const String &var)
{
  if (var == "BUTTONPLACEHOLDER")
  {
    return prepareData();
  }
  else if (var == "WSYNC")
  {
    return prepareSync();
  }
  return String();
}

void callback(char *topic, byte *payload, unsigned int length)
{
  Serial.print("Message arrived [");
  Serial.print(topic);
  Serial.print("] ");


