hosein282/esp32_relex/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino.cpp
  unsigned char base64Data[length + 1];
  memcpy(base64Data, payload, length);
  base64Data[length] = '\0';


  unsigned char decodedData[256];
  int decodedLen = decode_base64(base64Data, decodedData);

  DynamicJsonDocument doc(256);
  DeserializationError error = deserializeJson(doc, decodedData);

  if (error)
  {
    Serial.print(F("deserializeJson() failed: "));
    Serial.println(error.f_str());
    return;
  }

  int out = doc["out"].as<int>();
  String event = doc["event"].as<String>();
  Serial.println(event);

  if (event == "io")
  {
    int type = doc["type"].as<String>().toInt();
    int time = 3;
    if (doc["time"] != "" && doc["time"] != nullptr)
    {
      time = doc["time"].as<int>();
    }
    bool state = doc["state"].as<bool>();
    String prg = outputIsBusy(out);

    Serial.print("event io : ");
    Serial.println(type);
    if (prg.isEmpty())
    {
      outputs[out].type = type;
      switchRelay(out, !state, time, false);

      doc["mac"] = mac;
      doc["event"] = "feedback";
      doc["oSt"] = outStates;
      String result;
      serializeJson(doc, result);
      Serial.println(result);
      publishReport(result.c_str());


    }
    else
    {
      Serial.println("output is busy");
    }

  }
  else if (event == "pwm")
  {

    uint8_t percent = doc["percent"].as<uint8_t>();

    Serial.print("event pwm : ");
    Serial.println(percent);

    setPwm(out, percent);


  }
  else if (event == "son")
  {
# 461 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
  }
  else if (event == "soff")
  {
# 489 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
  }
  else if (event == "ain")
  {
    Serial.print("event adc : ");

    readAnalogs();

    Serial.println(analogInputs[0].voltage);

    doc["mac"] = mac;
    doc["event"] = "feedback";
    JsonArray array = doc.createNestedArray("ain");

    for (uint8_t i = 0; i < totalAnalogs; i++)
    {
      array.add(analogInputs[i].voltage);
    }

    String result;
    serializeJson(doc, result);
    Serial.println(result);

    publishReport(result.c_str());


  }
  else if (event == "label")
  {

    String label = doc["label"].as<String>();
    uint8_t out = (msg.substring(1, 2).toInt()) - 1;
    if (out != -1)
    {
      String tempLabel = doc["label"].as<String>();

      writeToEEPROM(outputs[out].labelKey, tempLabel);
      outputs[out].label = tempLabel;
      String text = "نام رله " + String(out + 1) + " به " + tempLabel + " تغییر یافت ";
    }
  }
  else if (event == "timer")
  {
    String tempSch = doc["timer"].as<String>();

    String outPrg = outputIsBusy(out);
    if (outPrg != "")
    {
      String text = "رله " + String(out + 1) + " قفل و در حالت ";
      text = text + ((outPrg.charAt(0) == 's') ? "دزدگیر قرار دارد" : "پمپ قرار دارد");
      Serial.println(text);
      return;
    }
    writeDateTimeEEPROM(outputs[out].timerKey, tempSch);
    outputs[out].timer = tempSch;
    String result = prepareDbData("feedback");
    publishReport(result.c_str());

    String text;
    if (tempSch.length() >= 2 && tempSch.length() < 6 && tempSch.charAt(0) != 't')
    {
      String t;
      if (tempSch.substring(2, 3) == "-")
      {
        bool minus = true;
        t = tempSch.substring(2, 4) + " درجه ";
      }
      else
      {
        t = tempSch.substring(2, 4) + " درجه ";
      }
      if (tempSch.charAt(0) == 'c')
      {
        text = " عملکرد فن رله " + String(out + 1) + " در دمای پایینتر از" + t + " فعال شد";
      }
      else if (tempSch.charAt(0) == 'h')
      {
        text = " عملکرد هیتر رله " + String(out + 1) + " در دمای بالاتر از" + t + " فعال شد";
      }
    }
    else
    {
      text = "تایمر رله " + String(out + 1) + " فعال شد";
    }
    if (outputs[out].timer.charAt(0) == 't')
    {
      int8_t toggle = outputs[out].timer.substring(1).toInt();
      toggleTimers[out] = toggle * 2;
    }
    else
    {
      toggleTimers[out] = -1;
    }


  }
  else if (event == "scn")
  {

    String tempPrg = doc["value"].as<String>();
    String key = doc["key"].as<String>();
    Serial.println(tempPrg);
    if (tempPrg == "")
    {
      Serial.println("remove scn");
      removeScenario(key.c_str());
    }
    else
    {
      String text = addScenario(tempPrg);
      if (text != "")
      {
        String result = prepareDbData("feedback");
        publishReport(result.c_str());

        debugPrint("Input " + key + " is Set :");
        debugPrint(tempPrg);
      }
    }


  }
  else if (event == "status")
  {
    String result = prepareDbData("feedback");

    publishReport(result.c_str());


  }
  else if (event == "update")
  {
    String url = doc["url"].as<String>();
    int newVer = doc["version"].as<short>();
    Serial.println("Url:");
    Serial.println(url);
    if (newVer > VERSION)
    {
      checkUpdate(url);
    }
    else
    {
      Serial.println("Device is Already Update!");
      doc["mac"] = mac;
      doc["event"] = "feedback";
      doc["update"] = false;
      doc["version"] = VERSION;
      doc.remove("url");
      String result;
      serializeJson(doc, result);
      Serial.println(result);
      publishReport(result.c_str());

      updatedDisplay();
    }

  }
  else if (event == "rfReg")
  {

    handleRemoteRegister();
  }
  else if (event == "rfDel")
  {
    handleRemoveRemote();

  }
  else if (event == "admins")
  {
    String tempPhone = "";
    uint8_t index = 30;
    if (!doc["phone"].isNull())
    {
      tempPhone = doc["phone"].as<String>();
    }
    if (!doc["index"].isNull())
    {
      index = doc["index"].as<uint8_t>();
    }
    Serial.println("phone");
    Serial.println(tempPhone);
    Serial.println(index);
    if ((index <= 5 && index >= 0) && (tempPhone == ""))
    {

      writeToEEPROM(offsetPhone[index], "");
      phoneNo[index] = tempPhone;
    }
    else if ((index >= 0 && index <= 5) && tempPhone.length() == 13)
    {

      phoneNo[index] = tempPhone;
      writeToEEPROM(offsetPhone[index], tempPhone);
    }
    String text;
    for (uint8_t i = 0; i < totalPhoneNo; i++)
    {
      if (!phoneNo[i].isEmpty())
      {
        text += phoneNo[i];
      }
      if (i != (totalPhoneNo - 1))
      {
        text += ",";
      }
    }
    doc.remove("phone");
    doc.remove("index");

    Serial.println(text);
    doc["mac"] = mac;
    doc["event"] = "feedback";
    doc["admins"] = text;
    String result;
    serializeJson(doc, result);
    Serial.println(result);
    publishReport(result.c_str());
  }


