hosein282/esp32_relex/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino.cpp
}
uint8_t mqtt_count = 0;

void reconnect()
{
  if (mqtt_count > 6)
  {
    hasGSM = false;
    hasWifi = false;
    return;
  }
  const char *broker = m_server.c_str();
  if (hasWifi && !gprsConnected && !forceUseGprs)
  {
    activeClient = &wifiClient;
    mqtt.setClient(*activeClient);
    mqtt.setServer(broker, port);
    mqtt.setCallback(callback);
    mqttNet = WIFI;
    Serial.println("mqttNet");
    Serial.println(mqttNet);
  }

  else if (gprsConnected)
  {
    activeClient = &gsmClient;

    mqtt.setClient(*activeClient);
    mqtt.setServer(broker, port);
    mqtt.setCallback(callback);

    mqttNet = GPRS;
    Serial.println("mqttNet");
    Serial.println(mqttNet);
  }
  mqtt.setBufferSize(1024);


  if (!mqtt.connected())
  {
    mqtt_connected = false;
    Serial.print("Attempting MQTT connection...");

    char clientId[24];
    snprintf(clientId, sizeof(clientId), "ESP32Client-%04X", random(0xffff));

    String myTopic = sub_topic + ">" + mac;


    StaticJsonDocument<64> payload;
    payload["event"] = "state";
    payload["mac"] = mac;
    payload["status"] = "OFFLINE";
    payload["net"] = mqttNet;

    char jsonBuffer[128];
    serializeJson(payload, jsonBuffer, sizeof(jsonBuffer));


    if (mqtt.connect(clientId, "hosein282", "At9127995883", "action_server", 0, false, jsonBuffer))
    {
      Serial.println("connected");
      Serial.println("Sub to");
      Serial.println(myTopic);


      StaticJsonDocument<64> payload;
      payload["event"] = "state";
      payload["mac"] = mac;
      payload["status"] = "ONLINE";
      payload["net"] = mqttNet;

      char jsonBuffer[128];
      serializeJson(payload, jsonBuffer, sizeof(jsonBuffer));



      publishReport(jsonBuffer);


      mqtt.subscribe(myTopic.c_str());
      mqtt_connected = true;
    }
    else
    {
      Serial.print("failed, rc=");
      Serial.print(mqtt.state());

      mqtt_count = mqtt_count + 1;
      delay(3000);
    }
  }
}




void initLittleFS()
{
  if (!LittleFS.begin(true))
  {
    Serial.println("An error has occurred while mounting LittleFS");
  }
  Serial.println("LittleFS mounted successfully");



  unsigned int totalBytes = LittleFS.totalBytes();
  unsigned int usedBytes = LittleFS.usedBytes();

  Serial.println("File sistem info.");

  Serial.print("Total space:      ");
  Serial.print(totalBytes);
  Serial.println("byte");

  Serial.print("Total space used: ");
  Serial.print(usedBytes);
  Serial.println("byte");
}


String readFile(fs::FS &fs, const char *path)
{
  Serial.printf("Reading file: %s\r\n", path);

  File file = fs.open(path);
  if (!file || file.isDirectory())
  {
    Serial.println("- failed to open file");
    return String();
  }

  String fileContent = file.readString();
  file.close();






  return fileContent;
}


void writeFile(fs::FS &fs, const char *path, const char *message)
{
  Serial.printf("Writing file: %s\r\n", path);
  File file = fs.open(path, FILE_WRITE);
  if (!file)
  {
    Serial.println("- failed to open file for writing");
    return;
  }
  if (file.print(message))
  {
    Serial.println("- file written");
  }
  else
  {
    Serial.println("- write failed");
  }
}

void deleteData(fs::FS &fs, const char *path)
{

  fs.remove(path);
}


bool initWiFi()
{
  wifiTryCount++;
  if (wifiTryCount > 3)
  {
    Serial.println("Wifi try count is over");
    return false;
  }







  if (ssid == "" || password == "")
  {
    Serial.println("Undefined SSID or IP address.");
    resetWifi();
    return false;
  }

  WiFi.mode(WIFI_STA);
# 910 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
  WiFi.begin(ssid, password);
  Serial.println("Connecting to WiFi...");

  unsigned long currentMillis = millis();
  previousMillis = currentMillis;

  while (WiFi.status() != WL_CONNECTED)
  {
    currentMillis = millis();
    if (currentMillis - previousMillis >= 10000)
    {
      Serial.println("Failed to connect.");

      return false;
    }
  }

  if (!MDNS.begin("hubway"))
  {
    Serial.println("Error setting up MDNS responder!");
  }
  Serial.print("Current ESP32 IP: ");
  Serial.println(WiFi.localIP());
  hasWifi = true;
  esp_task_wdt_reset();

  printLocalTime();

  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
            { request->send_P(200, "text/html", index_html, processor); });
  server.serveStatic("/", LittleFS, "/");

  server.on(
      "/sw", HTTP_POST, [](AsyncWebServerRequest *request)
      { Serial.println("sw"); },
      NULL, handlePostRequest);

  server.on("/update", HTTP_GET, [](AsyncWebServerRequest *request)
            {
    String inputMessage1;
    String inputMessage2;

    if (request->hasParam(PARAM_INPUT_1) && request->hasParam(PARAM_INPUT_2)) {
      inputMessage1 = request->getParam(PARAM_INPUT_1)->value();
      inputMessage2 = request->getParam(PARAM_INPUT_2)->value();

      if (outputs[inputMessage1.toInt()].timer != "") {
        clearTimer(inputMessage1.toInt());
      }
      switchRelay(inputMessage1.toInt(), inputMessage2.toInt(), 0, false);


    } else if (request->hasParam(PARAM_INPUT_1) && request->hasParam(PARAM_INPUT_3)) {
      inputMessage1 = request->getParam(PARAM_INPUT_1)->value();
      inputMessage2 = request->getParam(PARAM_INPUT_3)->value();
      debugPrint(inputMessage2);

      if (inputMessage2.toInt() == 0) {
        clearTimer(inputMessage1.toInt());
      } else {

        uint8_t index = inputMessage1.toInt();
        writeDateTimeEEPROM(outputs[index].timerKey, inputMessage2);
        outputs[index].timer = inputMessage2;
        debugPrint("Relay 1 is Set :");
        debugPrint(inputMessage2);
      }
    } else if (request->hasParam(PARAM_INPUT_2) && request->hasParam(PARAM_INPUT_5)) {
      inputMessage1 = request->getParam(PARAM_INPUT_5)->value();
      inputMessage2 = request->getParam(PARAM_INPUT_2)->value();
      debugPrint(inputMessage2);


      uint8_t index = inputMessage1.toInt();
      uint8_t percent = inputMessage2.toInt();
      setPwm(index, percent);
      Serial.println("Pwm");
      Serial.println(index + 1);
      Serial.println(" is Set :");
      Serial.println(percent);

    } else if (request->hasParam("date")) {
      inputMessage1 = request->getParam("date")->value();
      debugPrint(inputMessage1);


      String dateTime = inputMessage1;

      dateTime = "\"" + dateTime + "\"";
      Serial.println(dateTime);

      updateDate(dateTime);
      Serial.println("date updated!");

    } else {
      inputMessage1 = "No message sent";
      inputMessage2 = "No message sent";
    }
    Serial.print("GPIO: ");
    Serial.print(inputMessage1);
    Serial.print(" - Set to: ");
    Serial.println(inputMessage2);
    request->send(200, "text/plain", "OK"); });

  server.on(
      "/label", HTTP_POST, [](AsyncWebServerRequest *request)
      {
      Serial.println("body:");
      uint8_t paramsNr = request->params();
      Serial.println(paramsNr);
      String key;
      String val;
      for (uint8_t i = 0; i < paramsNr; i++) {
        AsyncWebParameter *p = request->getParam(i);
        Serial.print("Param name: ");
        key = p->name();
        Serial.println(key);
        Serial.print("Param value: ");
        val = p->value();
        Serial.println(val);
        Serial.println("------");
      }

      uint8_t index = val.substring(0, 1).toInt();
      String labelTmp = val.substring(2);

      if (index >= 0 && index < 5 && !labelTmp.isEmpty()) {
        writeToEEPROM(outputs[index].labelKey, labelTmp);
        outputs[index].label = labelTmp;
        AsyncWebServerResponse *response = request->beginResponse(200, "text/plain", "OK");
        response->addHeader("Connection", "close");
        request->send(response);
      } else {
        AsyncWebServerResponse *response = request->beginResponse(406, "text/plain", "ERR");
        response->addHeader("Connection", "close");
        request->send(response);
      } });

