hosein282/esp32_relex/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino.cpp
  events.onConnect([](AsyncEventSourceClient *client)
                   {
                     if (deviceYear < 20)
                     {
                       events.send("", "date", millis());
                     }
                     if (client->lastId())
                     {
                       Serial.printf("Client reconnected! Last message ID that it got is: %u\n", client->lastId());
                     }



                   });

  server.addHandler(&events);

  server.begin();
  return true;
}
bool addTask(void (*taskFunction)(), unsigned long delay)
{
  if (taskCount >= MAX_TASKS)
  {
    return false;
  }

  taskQueue[taskCount].function = taskFunction;
  taskQueue[taskCount].executeAt = millis() + delay;
  taskCount++;
  return true;
}


void setupLCD()
{
  if (!display.begin(SSD1306_SWITCHCAPVCC, 0x3C))
  {
    Serial.println(F("SSD1306 allocation failed"));
    for (;;)
      ;
  }
  display.clearDisplay();
}

void welcomeDisplay()
{
}

void initDisplay()
{

  display.clearDisplay();




  display.clearDisplay();

  display.setCursor(2, 24);
  display.print("TEMP");
  display.setCursor(2, 34);
  display.println("WIFI");

  display.setCursor(2, 44);
  display.println("NET");

  display.setCursor(2, 54);
  display.println("OUTPUTS");
  display.display();
}

void updateDisplay()
{

  String m = String(rtc.getMinute());
  String d = String(rtc.getDate());
  if (m.length() == 1)
  {
    m = "0" + m;
  }
  String date = d.substring(d.indexOf(' ') + 1) + " " + String(rtc.getHour(true)) + ":" + m;

  display.setTextSize(1);
  display.setFont(NULL);
  display.setTextColor(WHITE);
  display.fillRect(12, 2, 120, 7, 0);

  display.setCursor(12, 2);
  display.print(date);
  display.setCursor(2, 14);
  if (op == "")
  {
    display.println("GSM");
  }
  else if (op == "mci")
  {
    display.println("IR-MCI");
  }
  else if (op == "irancell")
  {
    display.println("IRANCELL");
  }

  display.fillRect(80, 24, 48, 7, 0);

  String tmp = String(temps[0].value);
  display.setCursor(128 - ((tmp.length() + 2) * 6), 24);
  display.print(tmp + " C");
  display.fillRect(110, 12, 34, 7, 0);

  if (signalQuality <= 0 || signalQuality == 99)
  {
    display.setCursor(122, 14);
    display.println("x");



  }
  else if (signalQuality > 0 && signalQuality <= 7)
  {
    display.fillRect(110, 18, 3, 2, 1);
    display.drawRect(114, 16, 3, 4, 1);
    display.drawRect(118, 14, 3, 6, 1);
    display.drawRect(122, 12, 3, 8, 1);
  }
  else if (signalQuality > 7 && signalQuality <= 14)
  {
    display.fillRect(110, 18, 3, 2, 1);
    display.fillRect(114, 16, 3, 4, 1);
    display.drawRect(118, 14, 3, 6, 1);
    display.drawRect(122, 12, 3, 8, 1);
  }
  else if (signalQuality > 14 && signalQuality <= 21)
  {
    display.fillRect(110, 18, 3, 2, 1);
    display.fillRect(114, 16, 3, 4, 1);
    display.fillRect(118, 14, 3, 6, 1);
    display.drawRect(122, 12, 3, 8, 1);
  }
  else
  {
    display.fillRect(110, 18, 3, 2, 1);
    display.fillRect(114, 16, 3, 4, 1);
    display.fillRect(118, 14, 3, 6, 1);
    display.fillRect(122, 12, 3, 8, 1);
  }
  display.fillRect(74, 34, 34, 7, 0);

  if (WiFi.status() == WL_CONNECTED)
  {
    display.setCursor(74, 34);
    display.println("CONNECTED");
  }
  else
  {
    display.setCursor(110, 34);
    display.println("OFF");
  }

  display.fillRect(86, 44, 38, 7, 0);

  if (mqtt_connected)
  {
    display.setCursor(104, 44);
    display.println(mqttNet == 1 ? "WIFI" : "GPRS");
  }
  else
  {
    display.setCursor(86, 44);
    display.println("OFFLINE");
  }

  if (outStates != "")
  {
    String outs;
    for (uint8_t i = 0; i < totalOutputs; i++)
    {
      outs += outStates[(i * 2) + 1];
    }

    display.fillRect(50, 54, 78, 7, 0);

    display.setCursor(128 - (outs.length() * 6), 54);
    display.println(outs);
  }






  display.display();
}
void updateSignalDisp()
{
  display.fillRect(110, 12, 34, 7, 0);

  if (signalQuality <= 0 || signalQuality == 99)
  {
    display.setCursor(122, 14);
    display.println("x");



  }
  else if (signalQuality > 0 && signalQuality <= 7)
  {
    display.fillRect(110, 18, 3, 2, 1);
    display.drawRect(114, 16, 3, 4, 1);
    display.drawRect(118, 14, 3, 6, 1);
    display.drawRect(122, 12, 3, 8, 1);
  }
  else if (signalQuality > 7 && signalQuality <= 14)
  {
    display.fillRect(110, 18, 3, 2, 1);
    display.fillRect(114, 16, 3, 4, 1);
    display.drawRect(118, 14, 3, 6, 1);
    display.drawRect(122, 12, 3, 8, 1);
  }
  else if (signalQuality > 14 && signalQuality <= 21)
  {
    display.fillRect(110, 18, 3, 2, 1);
    display.fillRect(114, 16, 3, 4, 1);
    display.fillRect(118, 14, 3, 6, 1);
    display.drawRect(122, 12, 3, 8, 1);
  }
  else
  {
    display.fillRect(110, 18, 3, 2, 1);
    display.fillRect(114, 16, 3, 4, 1);
    display.fillRect(118, 14, 3, 6, 1);
    display.fillRect(122, 12, 3, 8, 1);
  }
}
void updateOperatorDisp()
{
  display.fillRect(2, 14, 48, 7, 0);

  display.setCursor(2, 14);
  if (op == "")
  {
    display.println("No GSM");
  }
  else if (op == "mci")
  {
    display.println("IR-MCI");
  }
  else if (op == "irancell")
  {
    display.println("IRANCELL");
  }
}
void updateStatesDSP()
{
  display.fillRect(0, 54, 128, 8, 0);
  display.setCursor(2, 54);
  display.println("OUTPUTS");
  if (outStates != "")
  {
    String outs;
    for (uint8_t i = 0; i < totalOutputs; i++)
    {
      outs += outStates[(i * 2) + 1];
    }
    display.setCursor(128 - (outs.length() * 6), 54);
    display.println(outs);
  }

  display.display();
}
void updateTempDSP()
{

  display.fillRect(0, 24, 128, 8, 0);

  display.setCursor(2, 24);
  display.print("TEMP");
  String tmp = String(temps[0].value);
  display.setCursor(128 - ((tmp.length() + 2) * 6), 24);
  display.print(tmp + " C");

  display.display();
}

void loadingDisplay(int progress, String title)
{
  uint8_t p = (progress * 86) / 100;
  display.clearDisplay();
  display.setTextColor(WHITE);
  display.setFont(NULL);

  display.setTextSize(2);
  display.setCursor(38, 4);
  display.println("VIIO");
  display.setTextSize(1);
  display.setTextWrap(0);
  display.setCursor(34, 24);
  display.println(title + "..");
  display.drawRect(20, 40, 90, 16, 1);
  display.fillRect(22, 42, p, 12, 1);
  display.display();
}

void alertDisplay()
{
  display.clearDisplay();
  display.setTextColor(WHITE);
  display.setTextSize(1);
  display.setFont(NULL);
  display.setCursor(42, 29);
  display.setTextWrap(0);
  display.println("ALERT !!!");
  display.setCursor(28, 42);
  display.println("Security Mode");
  display.display();
}
void alertEnableDisplay()
{
  display.clearDisplay();
  display.setTextColor(WHITE);
  display.setTextSize(1);
  display.setFont(NULL);
  display.setCursor(12, 42);
  display.println("Security Mode");
  display.setCursor(42, 29);
  display.setTextWrap(0);
  display.println("ENABLED");

