hosein282/esp32_relex/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino.cpp
  display.display();
}
void updatedDisplay()
{
  unsigned long startTime = millis();

  const uint8_t bitmap23[] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x3f, 0xff, 0xfc, 0x7f, 0xff, 0xfe, 0x60, 0x00, 0x06, 0x60, 0x00, 0x06, 0x60, 0x00, 0x06, 0x60, 0x00, 0x06, 0x60, 0x00, 0x06, 0x61, 0x81, 0x86, 0x61, 0xc3, 0x86, 0x60, 0xe7, 0x06, 0x70, 0x7e, 0x0e, 0x70, 0x3c, 0x0e, 0x70, 0x18, 0x0e, 0x38, 0x00, 0x1c, 0x38, 0x00, 0x1c, 0x1c, 0x00, 0x38, 0x0f, 0x00, 0xf0, 0x07, 0xe7, 0xe0, 0x03, 0xff, 0xc0, 0x00, 0xff, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

  display.clearDisplay();
  while (millis() - startTime < 3000)
  {
    display.println("");
    display.drawBitmap(54, 30, bitmap23, 24, 24, 1);
    display.setCursor(18, 10);
    display.println("Already Updated!");
    display.display();
  }
  initDisplay();
  updateDisplay();
}
void smsDisplay()
{

  static const unsigned char PROGMEM image_ALARM_icon_bits[] = {0x00, 0x00, 0x13, 0xc8, 0x66, 0x66, 0x4c, 0x32, 0x8a, 0x11, 0x98, 0x19, 0x10, 0x08, 0x10, 0x08, 0x10, 0x08, 0x3f, 0xfc, 0x60, 0x06, 0x7f, 0xfe, 0x7f, 0xfe, 0x06, 0x60, 0x03, 0xc0, 0x00, 0x00};





  display.drawBitmap(54, 14, image_ALARM_icon_bits, 16, 16, 1);
  display.display();

  addTask(clearSmsDisplay, 3000);
}

void clearSmsDisplay()
{
  display.fillRect(54, 14, 17, 17, 0);
}
void reloadDisplay()
{
  initDisplay();
  updateDisplay();
}

void displayRemoteRg(String remote, unsigned long time)
{

  unsigned long t = (int)(time * 92) / 24000;
  display.clearDisplay();
  display.setCursor(28, 10);
  display.println("ADD REMOTE..");
  display.setCursor(31, 28);
  display.println("set " + remote);
  display.drawRoundRect(20, 44, 92, 16, 3, 1);
  display.fillRoundRect(20, 44, t, 16, 3, 1);
  display.display();
}
void displayRemoteDel(String remote, unsigned long time)
{

  unsigned long t = (int)(time * 92) / 24000;
  display.clearDisplay();
  display.setCursor(28, 10);
  display.println("Remove REMOTE..");
  display.setCursor(31, 28);
  display.println("del " + remote);
  display.drawRoundRect(20, 44, 92, 16, 3, 1);
  display.fillRoundRect(20, 44, t, 16, 3, 1);
  display.display();
}




void setup()
{
  EEPROM.begin("esp");

  setupLCD();




  Serial.begin(9600);
  delay(1000);
  Serial.print("Firmware Version=>");
  Serial.println(VERSION);
  loadingDisplay(0, "Setup");

  Serial.print("free Entries: ");
  Serial.println(EEPROM.freeEntries());



  Serial2.begin(9600, SERIAL_8N1, rxPin, txPin);


  pinMode(RESET_GSM, OUTPUT);

  GsmReset();
  delay(2000);
  esp_task_wdt_init(100, true);
  esp_task_wdt_add(NULL);

  initLittleFS();
  loadingDisplay(10, "Init Data");




  sensors.begin();

  sensors.requestTemperatures();

  for (uint8_t i = 0; i < totalTemps; i++)
  {
    temps[i].value = sensors.getTempCByIndex(i);
  }




  configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);


  mySwitch.enableReceive(4);

  button.attach(BUTTON_PIN, INPUT_PULLUP);

  button.interval(5);

  button.setPressedState(LOW);

  Serial.println("SIM800L software serial initialize");
  loadingDisplay(20, "init I/O");


  for (uint8_t i = 0; i < totalOutputs; i++)
  {
    digitalWrite(outputs[i].gpio, HIGH);

    pinMode(outputs[i].gpio, OUTPUT);
  }
  for (uint8_t i = 0; i < totalInputs; i++)
  {
    pinMode(inputs[i].gpio, INPUT_PULLUP);
  }

  for (uint8_t i = 0; i < totalPwm; i++)
  {
    ledcSetup(i, freq, 8);
    ledcAttachPin(pwms[i].gpio, i);
  }

  loadingDisplay(30, "Load Data");


  digitalWrite(STATUS_LED, LOW);
  pinMode(STATUS_LED, OUTPUT);



  setupVariables();


  uint8_t gsmCounter = 0;

  loadingDisplay(40, "Set Wifi");

  if (initWiFi())
  {

    reconnect();
  }
  else
  {
    initWifiAp();
  }

  delay(1000);
  if (checkSim())
  {
    while (!isRegistered())
    {
      gsmCounter = gsmCounter + 1;
      flipper.attach(0.5, flip);
      loadingDisplay(50 + (gsmCounter * 6), "Setup GSM");
      delay(3000);
      if (gsmCounter > 6)
      {
        GsmReset();
        gsmCounter = 0;

        break;
      }
    }
  }
  else
  {
    flipper.attach(1, flip);
    Serial.println("Insert a sim card");
  }
  loadingDisplay(100, "Completed");

  delay(500);

  if (hasGSM)
  {
    setupGSM();
  }




  if (phoneNo[0].length() == 13)
  {






    debugPrint("Admin Phone Is Registered");
    flipper.detach();

    delay(100);
  }
  initDisplay();

  checkTasks();

}





unsigned long prevTemp = 0;
void loop()
{
  esp_task_wdt_reset();

  now = millis();


  while (Serial2.available() > 0)
  {
    parseData(Serial2.readString());
  }



  if (now - prevTaskTime >= SCH_TASK_TIME)
  {
    checkTasks();
    prevTaskTime = now;
  }



  checkSensors();

  readAnalogs();

  readButton();

  checkRfRemote();

  if (now - prevTemp >= 15000)
  {
    sensors.requestTemperatures();
    for (uint8_t i = 0; i < totalTemps; i++)
    {
      float t = sensors.getTempCByIndex(i);
    }
    prevTemp = now;
  }
  runScenarios();

  checkRelayTimes();

  processTasks();



  checkMqttStatus();
}

void processTasks()
{
  unsigned long currentTime = millis();

  for (int i = 0; i < taskCount; i++)
  {
    if (currentTime >= taskQueue[i].executeAt)
    {
      taskQueue[i].function();


      for (int j = i; j < taskCount - 1; j++)
      {
        taskQueue[j] = taskQueue[j + 1];
      }
      taskCount--;
      i--;
    }
  }
}

void checkRelayTimes()
{
  for (uint8_t i = 0; i < totalOutputs; i++)
  {
    if (outputs[i].type == 0 || outputs[i].type == 2 || outputs[i].now == 0)
      continue;

    if (outputs[i].now > 0 && (millis() - outputs[i].now) >= (outputs[i].time * 1000))
    {
      boolean targetState = 1;
      digitalWrite(outputs[i].gpio, HIGH);
      outputs[i].state = targetState;
      outStates[(i * 2) + 1] = targetState ? '0' : '1';
      Serial.println("targetState");
      Serial.println(outputs[i].state);



      for (int j = 0; j < totalScenarios; j++)
      {
        Scenario scenario = scenarios[j];
        if (scenario.value.isEmpty() || scenario.value.charAt(0) != 'o')
          continue;
        uint8_t target = 100;
        if (i == scenario.input)
        {
          target = scenario.outPin;
        }
        else if (i == scenario.outPin)
        {
          target = scenario.input;
        }
        if (target != 100)
        {
          if (scenario.condition == "==")
          {
            digitalWrite(outputs[target].gpio, targetState);
            outputs[target].state = !targetState;
            outStates[(target * 2) + 1] = targetState ? '0' : '1';
            continue;
          }
          else
          {
            digitalWrite(outputs[target].gpio, !targetState);
            outputs[target].state = !targetState;
            outStates[(target * 2) + 1] = targetState ? '0' : '1';
            continue;
          }
        }
      }


      sendMqttFeedback();


      outputs[i].now = 0;
    }
  }
}
void switchRelay(uint8_t index, bool state, uint16_t time, bool isLocked)
{
  if (state == digitalRead(outputs[index].gpio))
  {
    Serial.println("switch return");
    return;
  }

  digitalWrite(outputs[index].gpio, state);

  outputs[index].state = !state;
  outStates[(index * 2) + 1] = state ? '0' : '1';

  Serial.println(outputs[index].state);



