hosein282/esp32_relex/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino.cpp
  for (int i = 0; i < totalScenarios; i++)
  {
    Scenario scenario = scenarios[i];
    if (scenario.value.isEmpty() || scenario.value.charAt(0) != 'o')
      continue;
    uint8_t target = 100;
    if (index == scenario.input)
    {
      target = scenario.outPin;
    }
    else if (index == scenario.outPin)
    {
      target = scenario.input;
    }
    if (target != 100)
    {
      if (scenario.condition == "==")
      {
        digitalWrite(outputs[target].gpio, state);
        outputs[target].state = !state;
        outStates[(target * 2) + 1] = state ? '0' : '1';
        continue;
      }
      else
      {
        digitalWrite(outputs[target].gpio, !state);
        outputs[target].state = !state;
        outStates[(target * 2) + 1] = state ? '0' : '1';
        continue;
      }
    }
  }


  sendMqttFeedback();


  if (state)
  {
    outputs[index].now = 0;
  }

  outputs[index].locked = isLocked;

  if (isLocked)
    return;


  if (outputs[index].type == 0)
  {

    Serial.println("Unlock");
  }
  else if (outputs[index].type == 2 && !state)
  {
    delay(1000);
    digitalWrite(outputs[index].gpio, !state);
    outputs[index].state = state;
    outStates[(index * 2) + 1] = !state ? '0' : '1';



    sendMqttFeedback();
  }
  else if (outputs[index].type == 1 && !state)
  {
    outputs[index].now = millis();
    outputs[index].time = time;




  }
  if (time > 0)
  {
    outputs[index].now = millis();
    outputs[index].time = time;
  }
}

void runScenarios()
{
  for (int i = 0; i < totalScenarios; i++)
  {
    Scenario scenario = scenarios[i];
    if (scenario.value.isEmpty())
      continue;
    char it = scenario.value.charAt(0);
    char ot = scenario.value.charAt(1);

    bool oCondition = false;

    bool conditionMet = false;
    float ifStatement;
    float bias;
    int time = 0;
    if (scenario.swType == 1)
    {
      time = 3;
    }

    if (it == 'o')
    {
      continue;
    }
    else if (it == 't')
    {
      ifStatement = temps[scenario.input].value;
      bias = TEMP_THRESHOLD_BIAS;
    }
    else if (it == 'd')
    {
      ifStatement = digitalRead(inputs[scenario.input].gpio);
    }
    else if (it == 'a')
    {
      ifStatement = analogInputs[scenario.input].voltage;
      bias = THRESHOLD_BIAS;
    }


    if (ot == 'p')
    {
      oCondition = pwms[scenario.outPin].pwm == scenario.outState;
    }
    else
    {

      oCondition = outputs[scenario.outPin].state == scenario.outState;
    }



    if (it == 'd' && ot == 'r')
    {


      if (scenario.condition == "==" && ifStatement == scenario.outState)
      {
        conditionMet = true;
      }
      else if (scenario.condition == "!=" && ifStatement != scenario.outState)
      {
        conditionMet = true;
      }

    }
    else if (it == 't')
    {

      if (oCondition)
      {




        if (scenario.condition == ">" && ifStatement < scenario.threshold - bias)
        {

          conditionMet = true;
        }
        else if (scenario.condition == "<" && ifStatement > scenario.threshold + bias)
        {

          conditionMet = true;
        }
        else if (scenario.condition == "==" && (int)ifStatement == (int)scenario.threshold)
        {

          conditionMet = true;
        }

      }
      else
      {
        if (scenario.condition == ">" && ifStatement > scenario.threshold)
        {


          conditionMet = true;
        }
        else if (scenario.condition == "<" && ifStatement < scenario.threshold)
        {


          conditionMet = true;
        }
        else if (scenario.condition == "==" && ifStatement == scenario.threshold)
        {


          conditionMet = true;
        }
      }

    }
    else if (it == 'a')
    {


      if (oCondition)
      {


        if (scenario.condition == ">" && ifStatement < scenario.threshold - bias)
        {

          conditionMet = true;
        }
        else if (scenario.condition == "<" && ifStatement > scenario.threshold + bias)
        {
          conditionMet = true;
        }
        else if (scenario.condition == "==" && (int)ifStatement == (int)scenario.threshold)
        {
          conditionMet = true;
        }

      }
      else
      {
        if (scenario.condition == ">" && ifStatement > scenario.threshold)
        {


          conditionMet = true;
        }
        else if (scenario.condition == "<" && ifStatement < scenario.threshold)
        {


          conditionMet = true;
        }
        else if (scenario.condition == "==" && ifStatement == scenario.threshold)
        {


          conditionMet = true;
        }
      }
    }


    if (conditionMet)
    {
      if (ot == 'p')
      {
        setPwm(scenario.outPin, scenario.outState);

      }
      else
      {
        if (oCondition)
        {
          if (scenario.swType != 0)
          {
            switchRelay(scenario.outPin, scenario.outState, time, false);
            Serial.println("conditionMet unlocked");
            continue;
          }
          else
          {
            Serial.println("conditionMet lock type");
            continue;
          }
        }
        else
        {

          switchRelay(scenario.outPin, !scenario.outState, time, true);
          Serial.println("conditionMet locked");
          if (scenario.notif == 1 && notifyScenarios)
          {
            notifHexSms(i, phoneNo[0]);
          }
          else if (scenario.notif == 2 && notifyScenarios)
          {

            callAdmin(i);
          }
          continue;

        }
      }
    }
  }
}

void notifHexSms(int index, String phone)
{
  if (phone == "")
    return;
  Scenario scenario = scenarios[index];
  char it = scenario.value.charAt(0);
  char ot = scenario.value.charAt(1);

  String text = "سناریو " + String(index + 1) + "اجراشد " + "\n";
  if (it == 'a')
  {
    text += "سنسور " + String(scenario.input + 1) + " از " + String(scenario.threshold / 40.96);
  }
  else if (it == 'd')
  {
    text += " دیجیتال" + String(scenario.input + 1) + "تحریک شد ";
  }
  else if (it == 't')
  {
    text += "دماسنج " + String(scenario.input + 1) + " از " + String(scenario.threshold);
  }

  if (scenario.condition == ">")
  {
    text += " بیشتر شد";
  }
  else if (scenario.condition == "<")
  {
    text += " کمتر شد";
  }
  if (ot == 'r')
  {
    text += " و رله" + String(scenario.outPin + 1) + " روشن شد";
  }

  if (millis() - scenarios[index].lastNotif > 60000)
  {
    scenarios[index].lastNotif = millis();
    ReplyHex(text, phone);
  }
}


void setupVariables()
{

  outStates = createOutArray();
  inStates = createInArray();
  pwmStates = createPwmArray();





