hosein282/esp32_relex/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino.cpp
  for (int i = 0; i < totalInputs; i++)
  {
    inputs[i].lastTrigger = 0;
  }
  for (int i = 0; i < totalAnalogs; i++)
  {
    analogInputs[i].lastTrigger = 0;
  }

  Serial.println("WIFI Credentials");


  ssid = readFile(LittleFS, wifi_ssid);
  password = readFile(LittleFS, wifi_pass);
  String server = readFile(LittleFS, m_server_k);
  if (server.isEmpty())
  {
    m_server = "5.238.178.210";
  }
  else
  {
    m_server = server;
  }
  mac = readFile(LittleFS, mac_f);
  Serial.println(ssid);
  Serial.println(password);
  Serial.println(m_server);
  Serial.println(mac);





  Serial.println("List of Registered Phone Numbers");
  for (uint8_t i = 0; i < totalPhoneNo; i++)
  {
    phoneNo[i] = readFromEEPROM(offsetPhone[i]);
    if (phoneNo[i].length() != 13)
    {
      phoneNo[i] = "";
      Serial.println(String(i + 1) + ": empty");
      continue;
    }
    else
    {
      Serial.println(String(i + 1) + ": " + phoneNo[i]);
    }
  }


  Serial.println("List of Schedules");
  for (uint8_t i = 0; i < totalOutputs; i++)
  {
    outputs[i].timer = readFromEEPROM(outputs[i].timerKey);
    if (outputs[i].timer.length() < 2)
    {
      outputs[i].timer = "";
      Serial.println(String(i + 1) + ": empty");
      continue;
    }
    else
    {
      Serial.println(String(i + 1) + ": " + outputs[i].timer);
      if (outputs[i].timer.charAt(0) == 't')
      {
        int8_t toggle = outputs[i].timer.substring(1).toInt();
        toggleTimers[i] = toggle * 2;
      }
    }
  }
# 2231 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
  Serial.println("List of Scenarios");
  for (uint8_t i = 0; i < totalScenarios; i++)
  {
    String key = "s" + String(i + 1);
    scenarios[i].value = readFromEEPROM(key.c_str());
    if (scenarios[i].value.length() > 0)
    {
      processScenarios(scenarios[i].value, i);
      scenariosCount++;
      Serial.println(String(i + 1) + ": " + scenarios[i].value);
    }
    else
    {
      break;
    }
  }

  Serial.println("List of Output Labels");
  for (uint8_t i = 0; i < totalOutputs; i++)
  {
    outputs[i].label = readFromEEPROM(outputs[i].labelKey);
    if (outputs[i].label.length() > 0)
    {
      Serial.println(String(i + 1) + ": " + outputs[i].label);
    }
    else
    {
      outputs[i].label = "";
      Serial.println(String(i + 1) + ": empty");
    }
  }

  Serial.println("List of Input Labels");
  for (uint8_t i = 0; i < totalInputs; i++)
  {
    inputs[i].label = readFromEEPROM(inputs[i].labelKey);
    if (inputs[i].label.length() < 1)
    {
      inputs[i].label = "";
      Serial.println(String(i + 1) + ": empty");
    }
    else
    {
      Serial.println(String(i + 1) + ": " + inputs[i].label);
    }
  }

  Serial.println("List of Remotes");
  const char *filePath = "/remotes.txt";


  String fileContent = readFile(LittleFS, filePath);
  if (fileContent.isEmpty())
  {
    Serial.println("No Remote Registered");
  }
  else
  {
    Serial.println("Remote Registered");
    Serial.println(fileContent);
  }
# 2311 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
}

bool processScenarios(String command, uint8_t index)
{

  int comma1 = command.indexOf(':');
  int comma2 = command.indexOf(':', comma1 + 1);
  int comma3 = command.indexOf(':', comma2 + 1);
  int comma4 = command.indexOf(':', comma3 + 1);
  int comma5 = command.indexOf(':', comma4 + 1);

  String key = "s" + String(index + 1);
  strncpy(scenarios[index].key, key.c_str(), sizeof(scenarios[index].key) - 1);
  scenarios[index].key[sizeof(scenarios[index].key) - 1] = '\0';
  Serial.println(scenarios[index].key);
  scenarios[index].input = command.substring(2, comma1).toInt();
  scenarios[index].condition = command.substring(comma1 + 1, comma2);

  int val = command.substring(comma2 + 1, comma3).toInt();
  if (command.charAt(0) == 'a')
  {
    scenarios[index].threshold = (val * aResolution) / 100;
  }
  else
  {
    scenarios[index].threshold = val;
  }

  scenarios[index].outPin = command.substring(comma3 + 1, comma4).toInt();
  scenarios[index].outState = command.substring(comma4 + 1).toInt();
  scenarios[index].swType = command.substring(comma5 + 1).toInt();
  scenarios[index].notif = command.substring(comma5 + 2).toInt();
  Serial.println("scenarios[index].notif");
  Serial.println(scenarios[index].notif);

  if (scenarios[index].input == -1 || scenarios[index].outPin == -1)
  {
    return false;
  }
  scenarios[index].value = command;
  return true;
}

void handlePostRequest(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total)
{
  if (index == 0)
  {





    unsigned char base64Data[len + 1];
    memcpy(base64Data, data, len);
    base64Data[len] = '\0';


    unsigned char decodedData[512];
    int decodedLen = decode_base64(base64Data, decodedData);

    DynamicJsonDocument doc(512);
    DeserializationError error = deserializeJson(doc, decodedData);

    if (error)
    {
      Serial.print(F("deserializeJson() failed: "));
      Serial.println(error.f_str());
      return;
    }

    String model = doc["model"].as<String>();

    if (model == "" || model != DEVICE_MODEL)
    {
      request->send(400, "application/json", "{\"error\":\"device model\"}");
      Serial.println("device model is not verified");
      return;
    }


    ssid = doc["ssid"].as<String>();
    password = doc["password"].as<String>();
    m_server = doc["m_server"].as<String>();

    writeFile(LittleFS, wifi_ssid, ssid.c_str());
    writeFile(LittleFS, wifi_pass, password.c_str());

    writeFile(LittleFS, m_server_k, m_server.c_str());
    wifiTryCount = 0;
    StaticJsonDocument<128> payload;
    payload["status"] = "received";
    payload["mac"] = mac;

    char jsonBuffer[128];
    serializeJson(payload, jsonBuffer, sizeof(jsonBuffer));
    Serial.println(jsonBuffer);

    request->send(200, "application/json", jsonBuffer);
    delay(3000);
    ESP.restart();
  }
  else
  {
    request->send(400, "application/json", "{\"error\":\"No data\"}");
  }
}

