hosein282/esp32_relex/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino.cpp
void initWifiAp()
{
  ssid = "";
  password = "";
  if (mac.isEmpty())
  {
    mac = getMAC();
  }

  WiFi.softAP(ssid_ap + mac.substring(0, 2) + mac.substring(9, 11) + mac.substring(15, 17), "2NyTf21=");

  IPAddress IP = WiFi.softAPIP();
  Serial.print("AP IP address: ");
  Serial.println(IP);

  if (!MDNS.begin("hubway"))
  {
    Serial.println("Error setting up MDNS responder!");
  }


  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
            {


    request->send_P(200, "text/html", index_html, processor); });


  server.on("/ssid", HTTP_GET, [](AsyncWebServerRequest *request)
            {


    StaticJsonDocument<128> payload;
    payload["status"] = "received";
    payload["mac"] = mac;
    JsonArray array = payload.createNestedArray("ssid");

    int n = WiFi.scanNetworks();
    for (int i = 0; i < n; ++i) {
      array.add(WiFi.SSID(i));
    }
    char jsonBuffer[128];
    serializeJson(payload, jsonBuffer, sizeof(jsonBuffer));
    Serial.println(jsonBuffer);

    request->send(200, "application/json", jsonBuffer); });

  server.on(
      "/sw", HTTP_POST, [](AsyncWebServerRequest *request)
      { Serial.println("sw"); },
      NULL, handlePostRequest);


  server.on("/update", HTTP_GET, [](AsyncWebServerRequest *request)
            {
    String inputMessage1;
    String inputMessage2;

    if (request->hasParam(PARAM_INPUT_1) && request->hasParam(PARAM_INPUT_2)) {
      inputMessage1 = request->getParam(PARAM_INPUT_1)->value();
      inputMessage2 = request->getParam(PARAM_INPUT_2)->value();

      if (outputs[inputMessage1.toInt()].timer != "") {
        clearTimer(inputMessage1.toInt());
      }
      switchRelay(inputMessage1.toInt(), inputMessage2.toInt(), 0, false);



    } else if (request->hasParam(PARAM_INPUT_1) && request->hasParam(PARAM_INPUT_3)) {
      inputMessage1 = request->getParam(PARAM_INPUT_1)->value();
      inputMessage2 = request->getParam(PARAM_INPUT_3)->value();
      debugPrint(inputMessage2);

      if (inputMessage2.toInt() == 0) {
        clearTimer(inputMessage1.toInt());
      } else {

        uint8_t index = inputMessage1.toInt();
        writeDateTimeEEPROM(outputs[index].timerKey, inputMessage2);
        outputs[index].timer = inputMessage2;
        debugPrint("Relay 1 is Set :");
        debugPrint(inputMessage2);
      }
    } else if (request->hasParam(PARAM_INPUT_2) && request->hasParam(PARAM_INPUT_5)) {
      inputMessage1 = request->getParam(PARAM_INPUT_5)->value();
      inputMessage2 = request->getParam(PARAM_INPUT_2)->value();
      debugPrint(inputMessage2);


      uint8_t index = inputMessage1.toInt();
      uint8_t percent = inputMessage2.toInt();
      setPwm(index, percent);
      Serial.println("Pwm");
      Serial.println(index + 1);
      Serial.println(" is Set :");
      Serial.println(percent);

    } else if (request->hasParam("date")) {
      inputMessage1 = request->getParam("date")->value();
      debugPrint(inputMessage1);


      String dateTime = inputMessage1;

      dateTime = "\"" + dateTime + "\"";
      Serial.println(dateTime);

      updateDate(dateTime);
      Serial.println("date updated!");

    } else {
      inputMessage1 = "No message sent";
      inputMessage2 = "No message sent";
    }
    Serial.print("GPIO: ");
    Serial.print(inputMessage1);
    Serial.print(" - Set to: ");
    Serial.println(inputMessage2);
    request->send(200, "text/plain", "OK"); });

  server.on(
      "/label", HTTP_POST, [](AsyncWebServerRequest *request)
      {
      Serial.println("body:");
      uint8_t paramsNr = request->params();
      Serial.println(paramsNr);
      String key;
      String val;
      for (uint8_t i = 0; i < paramsNr; i++) {
        AsyncWebParameter *p = request->getParam(i);
        Serial.print("Param name: ");
        key = p->name();
        Serial.println(key);
        Serial.print("Param value: ");
        val = p->value();
        Serial.println(val);
        Serial.println("------");
      }

      uint8_t index = val.substring(0, 1).toInt();
      String labelTmp = val.substring(2);

      if (index >= 0 && index < 5 && !labelTmp.isEmpty()) {
        writeToEEPROM(outputs[index].labelKey, labelTmp);
        outputs[index].label = labelTmp;
        AsyncWebServerResponse *response = request->beginResponse(200, "text/plain", "OK");
        response->addHeader("Connection", "close");
        request->send(response);
      } else {
        AsyncWebServerResponse *response = request->beginResponse(406, "text/plain", "ERR");
        response->addHeader("Connection", "close");
        request->send(response);
      } });


  events.onConnect([](AsyncEventSourceClient *client)
                   {
                     if (deviceYear < 20)
                     {
                       events.send("", "date", millis());
                     }
                     if (client->lastId())
                     {
                       Serial.printf("Client reconnected! Last message ID that it got is: %u\n", client->lastId());
                     }



                   });

  server.addHandler(&events);

  server.begin();
}

String getMAC()
{
# 2610 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
  String macStr = WiFi.macAddress();
  macStr.toUpperCase();
  Serial.println(macStr);
  writeFile(LittleFS, mac_f, macStr.c_str());

  return macStr;
}

bool printLocalTime()
{


  Serial.print(F("Waiting for NTP time sync: "));
  struct tm timeinfo;


  uint8_t count = 0;
  while (count < 3 && !getLocalTime(&timeinfo))
  {
    count += 1;
    yield();
    delay(500);
    Serial.print(F("."));
  }
  Serial.println(F(""));

  if (timeinfo.tm_year < 2024 || timeinfo.tm_year > 2060)
  {
    Serial.println(F("Failed to obtain time"));
    return false;
  }
  String formattedDate = createDateString(timeinfo, 14);
  updateDate(formattedDate);


  Epoch_Time = rtc.getEpoch();
  return true;
}

void setTimezone(String timezone)
{
  Serial.printf("  Setting Timezone to %s\n", timezone.c_str());
  setenv("TZ", timezone.c_str(), 1);
  tzset();
}

void resetWifi()
{

  ssid = "";
  password = "";
  m_server = "";
  wifiTryCount = 0;
  deleteData(LittleFS, wifi_ssid);
  deleteData(LittleFS, wifi_pass);
  deleteData(LittleFS, m_server_k);

