hosein282/esp32_relex/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino.cpp
  hasWifi = false;
}

String createDateString(const struct tm &timeinfo, int timezoneOffset)
{

  String dateString = "\"";


  dateString += String(timeinfo.tm_year % 100) + "/";
  dateString += String(timeinfo.tm_mon + 1).length() == 1 ? "0" + String(timeinfo.tm_mon + 1) : String(timeinfo.tm_mon + 1);
  dateString += "/";
  dateString += String(timeinfo.tm_mday).length() == 1 ? "0" + String(timeinfo.tm_mday) : String(timeinfo.tm_mday);
  dateString += ",";


  dateString += String(timeinfo.tm_hour).length() == 1 ? "0" + String(timeinfo.tm_hour) : String(timeinfo.tm_hour);
  dateString += ":";
  dateString += String(timeinfo.tm_min).length() == 1 ? "0" + String(timeinfo.tm_min) : String(timeinfo.tm_min);
  dateString += ":";
  dateString += String(timeinfo.tm_sec).length() == 1 ? "0" + String(timeinfo.tm_sec) : String(timeinfo.tm_sec);


  dateString += (timezoneOffset >= 0 ? "+" : "") + String(timezoneOffset) + "\"";

  return dateString;
}

boolean TimePeriodIsOver(unsigned long &periodStartTime, unsigned long TimePeriod)
{
  unsigned long currentMillis = millis();
  if (currentMillis - periodStartTime >= TimePeriod)
  {
    periodStartTime = currentMillis;
    return true;
  }
  else
    return false;
}
unsigned long prevMqttReport = 0;

void publishReport(const char *payload)
{


  mqtt.publish("action_server", payload);

  events.send(payload, "data", now);


}
void checkSensors()
{





  for (uint8_t i = 0; i < totalInputs; i++)
  {

    if (digitalRead(inputs[i].gpio) != inputs[i].state && now > (inputs[i].lastTrigger + 1000))
    {
      inputs[i].lastTrigger = now;
      inputs[i].state = 1;

      Serial.println("Sensor" + String(i + 1) + " debounce");
      if (mqtt_connected)
      {
        DynamicJsonDocument doc(64);
        doc["mac"] = mac;
        doc["event"] = "report";
        doc["iSt"] = createInArray();
        String result;
        serializeJson(doc, result);
        Serial.println(result);
        publishReport(result.c_str());
      }


    }
    else if (digitalRead(inputs[i].gpio) != inputs[i].state)
    {
      inputs[i].state = 0;
      inputs[i].lastTrigger = now;
    }
  }
}

void readAnalogs()
{
  bool flag = false;
  for (uint8_t i = 0; i < totalAnalogs; i++)
  {
    int value = analogRead(analogInputs[i].gpio);
    if (abs(value - analogInputs[i].voltage) > analog_read_threshold && now > (analogInputs[i].lastTrigger + 5000))
    {
      Serial.println(abs(value - analogInputs[i].voltage));
      analogInputs[i].lastTrigger = now;
      flag = true;
    }
    analogInputs[i].voltage = value;
  }

  if (flag && mqtt_connected)
  {
    DynamicJsonDocument doc(64);
    doc["mac"] = mac;
    doc["event"] = "report";
    JsonArray array2 = doc.createNestedArray("ain");
    for (uint8_t i = 0; i < totalAnalogs; i++)
    {
      array2.add(analogInputs[i].voltage);
    }
    String result;
    serializeJson(doc, result);
    Serial.println(result);

    publishReport(result.c_str());
  }
}
# 2804 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
void checkRfRemote()
{

  if (mySwitch.available())
  {
    Serial.println("rf available");
    int value = mySwitch.getReceivedValue();

    if (value != 0)
    {

      Serial.print("Received ");
      Serial.print(value);
      Serial.print(" / ");
      Serial.print(mySwitch.getReceivedBitlength());
      Serial.print("bit ");
      Serial.print("Protocol: ");
      Serial.println(mySwitch.getReceivedProtocol());

      compareRemote(String(value));
      delay(500);
    }
    else
    {
      Serial.print("Unknown encoding");
    }
    mySwitch.resetAvailable();
  }
}

void readButton()
{
  button.update();

  if (button.pressed())
  {

    checkTasks();

    pressedTime = millis();
  }
  else if (button.released())
  {
    releasedTime = millis();
    unsigned long pressDuration = releasedTime - pressedTime;
    Serial.print("The button duration: ");
    Serial.println(pressDuration);

    if (pressDuration > SUPER_LONG_TIME)
    {
      resetWifi();
    }
    else if (pressDuration > VERY_LONG_TIME)
    {
      handleRemoveRemote();
    }
    else if (pressDuration > LONG_PRESS_TIME)
    {
      handleRemoteRegister();
    }
    else if (pressDuration > SHORT_PRESS_TIME)
    {

      handleShortPress();
    }
  }
}

void handleShortPress()
{
  Serial.println("short press");
  removeAllRemotes();
# 2893 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
}
void handleRemoteRegister()
{
  Serial.println("long press");
  unsigned long start = millis();
  unsigned long lastKey = millis();

  uint8_t relaysCount = 0;
  flipper.attach(0.2, flip);

  while (millis() - start < 24000)
  {
    displayRemoteRg(("Relay " + String(relaysCount + 1)), (millis() - start));

    if (relaysCount >= totalOutputs)
    {
      break;
    }
    while (millis() - lastKey < 4000)
    {
      if (mySwitch.available())
      {
        String value = String(mySwitch.getReceivedValue());
        if (value == 0)
        {
          Serial.print("Unknown encoding");
        }
        else
        {
          Serial.print("Received ");
          Serial.print(value);
          Serial.print(" / ");
          Serial.print(mySwitch.getReceivedBitlength());
          Serial.print("bit ");
          Serial.print("Protocol: ");
          Serial.println(mySwitch.getReceivedProtocol());


          Serial.println(value);

          saveRemoteCode(value.c_str(), relaysCount);
          delay(500);


        }

        mySwitch.resetAvailable();
      }
    }
    relaysCount = relaysCount + 1;
    lastKey = millis();
  }
  Serial.print("Loop Break!");

  flipper.detach();
  initDisplay();
  updateDisplay();
}
void saveRemoteCode(const char *code, uint16_t out)
{
  const char *filePath = "/remotes.txt";


  String fileContent = readFile(LittleFS, filePath);

  if (fileContent.indexOf(code) != -1)
  {
    Serial.println("Code already exists!");
    return;
  }



  fileContent += String(out) + String(code) + "\n";

  writeFile(LittleFS, filePath, fileContent.c_str());

  Serial.print("Saved code: ");
  Serial.println(code);
}
# 2991 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
void handleRemoveRemote()
{
  Serial.println("very long press");
  unsigned long start = millis();

  uint8_t relaysCount = 0;
  flipper.attach(0.2, flip);
  while (millis() < start + 15000)
  {
    displayRemoteDel(("Relay " + String(relaysCount + 1)), (millis() - start));

    if (relaysCount >= totalOutputs)
    {
      break;
    }
    if (mySwitch.available())
    {
      String value = String(mySwitch.getReceivedValue());
      if (value == 0)
      {
        Serial.print("Unknown encoding");
      }
      else
      {
        Serial.print("Received ");
        Serial.print(value);
        Serial.print(" / ");
        Serial.print(mySwitch.getReceivedBitlength());
        Serial.print("bit ");
        Serial.print("Protocol: ");
        Serial.println(mySwitch.getReceivedProtocol());


        removeRemoteCode(value.c_str());
        relaysCount = relaysCount + 1;
        delay(500);

