hosein282/esp32_relex/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino.cpp
      }

      mySwitch.resetAvailable();
    }
  }
  Serial.print("while loop breaks");

  flipper.detach();
  initDisplay();
  updateDisplay();
}

void removeAllRemotes()
{
  const char *filePath = "/remotes.txt";


  if (LittleFS.exists(filePath))
  {

    if (LittleFS.remove(filePath))
    {
      Serial.println("All remotes removed successfully!");
      remoteCount = 0;
    }
    else
    {
      Serial.println("Failed to remove remotes file!");
    }
  }
  else
  {
    Serial.println("No remotes file found to remove!");
  }


  File file = LittleFS.open(filePath, FILE_WRITE);
  if (file)
  {
    file.close();
    Serial.println("Empty remotes file created.");
  }
  else
  {
    Serial.println("Failed to create an empty remotes file.");
  }
}
void removeRemoteCode(const char *code)
{
  const char *filePath = "/remotes.txt";


  String fileContent = readFile(LittleFS, filePath);

  if (fileContent.isEmpty())
  {
    Serial.println("No remotes registered!");
    return;
  }


  String newContent = "";
  int lineStart = 0;
  bool codeFound = false;

  while (lineStart < fileContent.length())
  {
    int lineEnd = fileContent.indexOf('\n', lineStart);
    if (lineEnd == -1)
    {
      lineEnd = fileContent.length();
    }

    String line = fileContent.substring(lineStart, lineEnd);
    int colonIndex = line.indexOf(':');
    if (colonIndex != -1)
    {
      String storedCode = line.substring(colonIndex + 1);
      if (storedCode != code)
      {
        newContent += line + "\n";
      }
      else
      {
        codeFound = true;
      }
    }

    lineStart = lineEnd + 1;
  }

  if (codeFound)
  {

    writeFile(LittleFS, filePath, newContent.c_str());
    Serial.println("Remote code removed successfully!");
  }
  else
  {
    Serial.println("Remote code not found!");
  }
}
# 3148 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
void compareRemote(String received)
{

  const char *filePath = "/remotes.txt";


  String fileContent = readFile(LittleFS, filePath);

  if (fileContent.isEmpty())
  {
    Serial.println("No remotes registered!");
    return;
  }


  int lineStart = 0;
  while (lineStart < fileContent.length())
  {
    int lineEnd = fileContent.indexOf('\n', lineStart);
    if (lineEnd == -1)
    {
      lineEnd = fileContent.length();
    }

    String line = fileContent.substring(lineStart, lineEnd);

    String out = line.substring(0, 1);
    String code = line.substring(1);

    Serial.println(out);
    Serial.println(code);
    Serial.println(received);
    if (code == received)
    {
      uint8_t index = out.toInt();
      Serial.println("Remote matched!");
      Serial.print("Relay index: ");
      Serial.println(index);


      boolean state = digitalRead(outputs[index].gpio);
      switchRelay(index, !state, 0, false);

      return;
    }

    lineStart = lineEnd + 1;
  }

  Serial.println("Remote not registered!");
}
# 3275 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
void initSim800Mqtt()
{

  Serial.println("Connecting to GPRS...");

  Serial.println(mqtt_connected);
  if (mqtt_connected)
  {
    return;
  }

  if (!modem.gprsConnect(op == "irancell" ? irancell_apn : mci_apn))
  {
    Serial.println("Failed to connect to GPRS");
    addTask(initSim800Mqtt, 20000);
    return;
  }
  if (modem.isGprsConnected())
  {
    Serial.println("GPRS is connected");
    gprsConnected = true;
    reconnect();
  }
  else
  {
    Serial.println("GPRS is not connected");
  }

}

void setupGSM()
{



  getSignalQuality(false);



  readyForSms();

  getGsmDateTime();

  initSim800Mqtt();
}

void manageMqttConnection()
{

  if (!ssid.isEmpty() && !password.isEmpty())
  {
    if (initWiFi())
    {

      activeClient = &wifiClient;
      mqtt.setClient(*activeClient);
      mqtt.setServer(m_server.c_str(), port);
      mqtt.setCallback(callback);
      mqttNet = WIFI;
      Serial.println(F("MQTT over WiFi"));
      return;
    }
  }


  if (checkSim())
  {
    if (!gprsConnected)
    {
      if (!modem.gprsConnect(op == "irancell" ? irancell_apn : mci_apn))
      {
        Serial.println(F("Failed to connect to GPRS"));
        mqttNet = OFF;
        return;
      }
      gprsConnected = true;
    }
    if (modem.isGprsConnected())
    {
      activeClient = &gsmClient;
      mqtt.setClient(*activeClient);
      mqtt.setServer(m_server.c_str(), port);
      mqtt.setCallback(callback);
      mqttNet = GPRS;
      Serial.println(F("MQTT over GPRS"));
      return;
    }
  }


  mqttNet = OFF;
  Serial.println(F("MQTT not available"));
}

void checkMqttStatus()
{
  if (mqtt.connected())
  {
    mqtt.loop();
  }
  else if (hasWifi || gprsConnected)
  {
    reconnect();
  }
}

String SendShortCommand(String command, String response)
{
  Serial.print("Sending command: \"");
  Serial.print(command);
  Serial.println("\"");

  Serial2.print(command);
  Serial2.print("\r\n");

  return WaitForResponse(response);
}

String WaitForResponse(String response)
{
  String data;
  unsigned long startTime = millis();
  while (millis() - startTime < 5000)
  {
    if (Serial2.available() > 0)
    {
      data = Serial2.readString();
      Serial.println("read serial:");
      Serial.println(data);
      if (data.indexOf(response) != -1)
      {
        return data;
      }
    }
  }
  Serial.println("Did not receive data.");
  return "";
}

bool checkSim()
{
  SimStatus result = modem.getSimStatus();
  Serial.println(SimStatus(result));



  if (result != SIM_ERROR)
  {

    hasGSM = true;
    return true;
  }
  else
  {

    hasGSM = false;
    return false;
  }
}

void getOperator(bool report)
{
  String result = modem.getOperator();

  String newValue = "";
  if (result.indexOf("43235") != -1)
  {
    newValue = "irancell";
  }
  else if (result.indexOf("TCI") != -1)
  {
    newValue = "mci";
  }
  else
  {
    newValue = "-";
  }
  if (report && newValue != op)
  {

    StaticJsonDocument<64> doc;
    doc["mac"] = mac;
    doc["event"] = "report";
    doc["op"] = op;
    doc["sig"] = String(signalQuality);

    String result;
    serializeJson(doc, result);
    Serial.println(result);
    publishReport(result.c_str());


