hosein282/esp32_relex/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino.cpp
  }
  op = newValue;

  updateOperatorDisp();
  Serial.println("operator : ");
  Serial.println(result);
  Serial.println(op);

  events.send(buffer.c_str(), "gsm", millis());
}

void getSignalQuality(bool report)
{
  uint8_t s;
  s = modem.getSignalQuality();

  if (report && abs(s - signalQuality) > signal_threshold)
  {
    StaticJsonDocument<64> doc;

    doc["mac"] = mac;
    doc["event"] = "report";
    doc["op"] = op;
    doc["sig"] = String(signalQuality);
    String result;
    serializeJson(doc, result);
    Serial.println(result);

    publishReport(result.c_str());
  }
  updateSignalDisp();
  signalQuality = s;

  Serial.println("signal:");
  Serial.println(s);
  if (op.isEmpty())
  {
    getOperator(false);
  }
  events.send(String(s).c_str(), "signal", now);
}
void blinkLed()
{

  delay(100);

}
void GsmReset()
{
  Serial.println("gsm reset");
  digitalWrite(RESET_GSM, LOW);
  delay(300);
  digitalWrite(RESET_GSM, HIGH);
}

void checkOutputSch(uint8_t input)
{
# 3578 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
}

String addScenario(String val)
{
  if (scenariosCount >= totalScenarios)
  {
    Serial.println("max scenarios count reached");
    return "";
  }
  if (processScenarios(val, scenariosCount))
  {
    String key = "s" + String(scenariosCount + 1);
    writeDateTimeEEPROM(key.c_str(), val);
    scenariosCount++;

    String text = "";
    text = scenarios[scenariosCount].condition + "خروجی" + String(scenarios[scenariosCount].outPin) + String(scenarios[scenariosCount].outState);
    return text;
  }
}

void removeScenario(const char *key)
{
  Serial.println(key);
  writeToEEPROM(key, "");
  Serial.println("afret write");

  for (uint8_t i = 0; i < scenariosCount; i++)
  {
    Serial.println("scenarios[i].key");
    Serial.println(scenarios[i].key);
    if (strcmp(key, scenarios[i].key) == 0)
    {

      if (scenariosCount == 1)
      {

        scenarios[0].value = "";
      }
      else
      {
        Serial.println("Shift elements ");
        for (int j = i; j < scenariosCount - 1; j++)
        {
          scenarios[j] = scenarios[j + 1];
        }

        scenarios[scenariosCount - 1].value = "";
      }
      scenariosCount--;

      Serial.println("scenario deleted");
      String result = prepareDbData("feedback");
      publishReport(result.c_str());


    }
  }
}

void readyForSms()
{



  SendShortCommand("AT+CLIP=1\r", "");
  delay(500);
  SendShortCommand("AT+CMGF=1", "");



  if (op == "irancell")
  {

    SendShortCommand("AT+CSMP=17,167,0,0", "");

    delay(500);
  }


  SendShortCommand("AT+CMGD=1,4", "");

  delay(1000);


  SendShortCommand("AT+CMGDA= \"DEL ALL\"", "");


  smsIsReady = true;
}

void receiveSms()
{
  uint8_t index = 0;
  String result = "";

  while (index < 3)
  {
    index++;
    result = SendShortCommand("AT+CMGF=1", "CMGF=1");
    if (result.indexOf("OK") != -1)
    {
      delay(500);
      SendShortCommand("AT+CSCS=\"GSM\"", "");


      delay(500);
      SendShortCommand("AT+CSMP=17,167,0,0", "");
      break;
    }
    else
    {
      delay(3000);
    }
  }







}

void getGsmDateTime()
{
  if (deviceYear < 20)
  {
    String result;

    delay(1000);
    if (op == "irancell")
    {

      SendShortCommand("AT+SAPBR=3,1, \"Contype\",\"GPRS\"", "");


      SendShortCommand("AT+SAPBR=3,1, \"APN\",\"CMNET\"", "");



      SendShortCommand("AT+SAPBR=1,1", "");



      SendShortCommand("AT+CNTPCID=1", "");


      SendShortCommand("AT+CNTP=\"3.asia.pool.ntp.org\",14", "");




      SendShortCommand("AT+CNTP", "");

      delay(500);

      result = SendShortCommand("AT+CCLK?", "+CCLK");


      delay(1000);

      SendShortCommand("AT+SAPBR=0,1", "");
    }
    else if (op == "mci")
    {
      Serial2.println("AT+CLTS=1\r");

      delay(500);
      Serial2.println("AT+COPS=0\r");

      delay(500);


      result = SendShortCommand("AT+CCLK?", "+CCLK");
      delay(1000);

    }




    if (result.indexOf("+CCLK") != -1)
    {
      Serial.println("result->");
      Serial.println(result);

      int ind = result.indexOf('"');
      result = result.substring(ind, result.length());
      Serial.print("date buufer=>");
      Serial.println(result);
      updateDate(result);
    }
  }
}







uint8_t smsIndex = 0;

void parseData(String buff)
{
  Serial.println("buffer =>");
  Serial.println(buff);



  unsigned int len, index;


  index = buff.indexOf("\r");
  buff.remove(0, index + 2);
  buff.trim();





  if (buff.indexOf("+CLIP") != -1)
  {
    index = buff.indexOf("\"");
    String phone = buff.substring(index + 1, index + 14);
    Serial.println("+CLIP state");
    Serial.println(phone);
    for (uint8_t i = 0; i < totalPhoneNo; i++)
    {
      if (buff.indexOf(phoneNo[i]) != -1)
      {
        Serial.println("Answered");
        delay(1000);
        answerCall();
        return;
      }
    }
    hangUp();
    return;
  }


  if (buff != "OK")
  {
    index = buff.indexOf(":");
    String cmd = buff.substring(0, index);
    cmd.trim();
    buff.remove(0, index + 2);



    if (buff == "ERROR" && smsIndex > 0)
    {
      Serial.println("In Error");
      Serial.print("last sms index : ");
      Serial.println(smsIndex);
      String temp = "AT+CMGR=" + String(smsIndex) + "\r";
      delay(500);

      Serial2.println(temp);
      return;

    }
# 3878 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
    else if (cmd == "+CPIN")
    {
      Serial.println("buufer==>");
      Serial.println(buff);

      int ind = buff.indexOf(':');
      buff = buffer.substring(ind + 1, buff.length());
      Serial.println("buufer:::");
      Serial.println(buff);
    }

    else if (cmd == "+CMTI")
    {
# 3899 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
      index = buff.indexOf(",");

      String temp = buff.substring(index + 1, buff.length());
      smsIndex = temp.toInt();
      temp = "AT+CMGR=" + temp + "\r";

