hosein282/esp32_relex/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino.cpp
      Serial2.println(temp);





    }
    else if (cmd == "+CPMS")
    {
      Serial.print("cmd == +CPMS");

      if (buff.indexOf("SM_P") != -1)
      {

        int index = buff.indexOf(",");
        smsIndex = buff.substring(index + 1, index + 2).toInt();

        if (smsIndex > 0)
        {
          for (uint8_t i = 0; i < smsIndex; i++)
          {
            Serial.print("last sms index");
            Serial.println(smsIndex);
            String temp = "AT+CMGR=" + String(smsIndex - i) + "\r";

            Serial2.println(temp);
          }
          smsIndex = 0;
        }
      }
      return;
    }
    else if (cmd == "+CUSD")
    {
      Serial.print("sender =>");
      Serial.println(senderNumber);
      extractUssd(buff);
      return;
    }
    else if (cmd == "+CMGR")
    {
      extractSms(buff);

      if (msg.equals("p") && phoneNo[0].length() == 13)
      {
        for (uint8_t i = 0; i < totalPhoneNo; i++)
        {
          if (phoneNo[i] == senderNumber)
          {
            String text = "1";
            text = prepareSMSStats();
            debugPrint(text);
            prepareData();
            ReplyHex(text, senderNumber);
          }
        }
      }
      else if (msg.equals("p") && phoneNo[0].length() != 13)
      {
        writeToEEPROM(offsetPhone[0], senderNumber);
        phoneNo[0] = senderNumber;







        String sms = "";
        sms = prepareSMSStats();
        debugPrint(sms);
        prepareData();
        ReplyHex(sms, senderNumber);
      }



      if (comparePhone(senderNumber))
      {
        doAction(senderNumber);

      }



      Serial2.println("AT+CMGD=1,4");
      delay(1000);
      if (smsIndex > 0)
      {
        String c = "AT+CMGD=" + String(smsIndex);
        Serial2.println(c);
        delay(1000);
        smsIndex = smsIndex - 1;
      }
    }

  }
}

void extractUssd(String buff)
{
  int startIndex = buff.indexOf('"');
  int endIndex = buff.indexOf('"', startIndex + 1);
  String str = buff.substring(startIndex + 1, endIndex);
  Serial.println("sub str");
  Serial.println(str);

  ForwardHex(str, senderNumber);
}


void readSerial()
{
  unsigned long startTime = millis();
  while (millis() - startTime < 5000)
  {
    if (Serial2.available() > 0)
    {
      Serial.println("read serial:");
      buffer = Serial2.readString();
      Serial.println(buffer);
    }
  }
}

bool isRegistered()
{
  return modem.isNetworkConnected();
# 4046 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
}






void extractSms(String buff)
{
  unsigned int index;

  index = buff.indexOf(",");
  smsStatus = buff.substring(1, index - 1);
  buff.remove(0, index + 2);
  senderNumber = buff.substring(0, 13);
  buff.remove(0, 19);

  receivedDate = buff.substring(0, 20);
  Serial.println("receive date =>");
  Serial.println(receivedDate);

  if (deviceYear < 20)
  {

    receivedDate = "\"" + receivedDate + "\"";
    updateDate(receivedDate);
  }
  else
  {

  }
  buff.remove(0, buff.indexOf("\r"));
  buff.trim();

  index = buff.indexOf("\n\r");
  buff = buff.substring(0, index);
  buff.trim();
  msg = buff;
  buff = "";
  msg.toLowerCase();


  if (isDigit(msg.charAt(0)) && isDigit(msg.charAt(1)))
  {

    Serial.println("UTF");

    msg = hexToUTF8(msg);
    msg.toLowerCase();

    Serial.println("The converted string is valid UTF-8:");



  }
  else
  {
    Serial.println("The converted string is NOT UTF8");
  }
  smsDisplay();


  String tempcmd = msg.substring(0, 3);

  if (tempcmd.equals("p1=") || tempcmd.equals("p2=") || tempcmd.equals("p3=") || tempcmd.equals("p4=") || tempcmd.equals("p5="))
  {

    tempPhone = msg.substring(3, 16);
    msg = tempcmd;
    debugPrint(msg);
    debugPrint(tempPhone);
  }
  else if (tempcmd.equals("t1=") || tempcmd.equals("t2=") || tempcmd.equals("t3=") || tempcmd.equals("t4="))
  {
    tempSch = msg.substring(3, 21);
    msg = tempcmd;
    debugPrint(msg);
    debugPrint("tempSch");
    debugPrint(tempSch);
  }
  else if (tempcmd.equals("i1=") || tempcmd.equals("i2=") || tempcmd.equals("i3=") || tempcmd.equals("i4="))
  {
    tempSch = msg.substring(3, 21);
    msg = tempcmd;
    debugPrint(msg);
    debugPrint("tempSch");
    debugPrint(tempSch);
  }
  else if (tempcmd.equals("t1x") || tempcmd.equals("t2x") || tempcmd.equals("t3x") || tempcmd.equals("t4x"))
  {
    msg = tempcmd;
    debugPrint(msg);
  }
  else if (tempcmd.indexOf("l") != -1 && tempcmd.indexOf("=") != -1)
  {

    tempLabel = msg.substring(3, 23);
    msg = tempcmd;
    debugPrint(tempLabel);
    debugPrint(msg);
  }
  else if (tempcmd.indexOf("n") != -1 && tempcmd.indexOf("=") != -1)
  {

    tempLabel = msg.substring(3, 23);
    msg = tempcmd;
    debugPrint(tempLabel);
    debugPrint(msg);
  }
  else if (tempcmd.equals("s"))
  {

    debugPrint(msg);
  }

}



void updateDate(String dateTime)
{

  Serial.println("date =>");
  Serial.println(dateTime);

  int year,
      month, day, hour, minute;

  year = (dateTime.substring(1, 3).toInt());
  if (deviceYear == 70)
  {
    return;
  }
  month = (dateTime.substring(4, 6).toInt());
  day = (dateTime.substring(7, 9).toInt());
  hour = (dateTime.substring(10, 12).toInt());
  minute = (dateTime.substring(13, 15).toInt());
  Serial.println("year =>");
  Serial.println(year);

  deviceYear = year;






  rtc.setTime(0, minute, hour, day, month, (2000 + year));

  checkTasks();
  Serial.println("rtc time");
  Serial.println(rtc.getDateTime(true));
}

void checkHourTasks()
{
  Serial.println("Hour Task");
}

void checkSmsHistory()
{
  Serial2.println("AT+CPMS?\r");
  delay(500);
}

void checkTasks()
{



  uint8_t dayOfWeek = rtc.getDayofWeek();
  uint8_t hour = rtc.getHour(true);
  uint8_t minute = rtc.getMinute();
  updateDisplay();




  if (minCounter > 60)
  {
    minCounter = 0;
    createMovingAverage();
  }

  if (minCounter > 0 && minCounter % 10 == 0)
  {

    uint8_t gsmCounter = 0;
    setAverageElement();

