hosein282/esp32_relex/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino.cpp
    if (hasWifi)
    {
      if (WiFi.status() != WL_CONNECTED && wifiTryCount < 2)
      {
        initWiFi();
      }
      else
      {





      }
    }
    else if (ssid != "" && password != "" && wifiTryCount < 2)
    {
      initWiFi();
    }
    if (hasGSM)
    {
      checkSmsHistory();
      if (op == "" || signalQuality == 0 || signalQuality == 99)
      {
        while (!isRegistered() && gsmCounter < 3)
        {
          GsmReset();
          flipper.attach(0.5, flip);
          gsmCounter++;
        }
      }
      else
      {
        checkSim();
      }
    }
  }

  if (minCounter % 5 == 0)
  {
    if (ssid != "" && password != "" && WiFi.status() != WL_CONNECTED && wifiTryCount < 2)
    {
      initWiFi();
    }
  }
  if (minCounter % 2 == 0)
  {


    if (hasGSM)
    {
      getSignalQuality(mqtt_connected);
      if (op == "")
      {
        getOperator(mqtt_connected);
      }
      if (signalQuality == 0 || signalQuality == 99)
      {
        GsmReset();
      }
    }
    else
    {
      checkSim();
    }
    if (hasWifi && !mqtt_connected)
    {
      reconnect();
    }
    else if (gprsConnected && !mqtt_connected)
    {
      reconnect();
    }
    if (deviceYear < 20 || deviceYear > 70)
    {

      if (hasWifi)
      {
        printLocalTime();
      }
      else if (hasGSM)
      {
        getGsmDateTime();
      }
    }
  }





  sensors.requestTemperatures();
  bool flag = false;
  for (uint8_t i = 0; i < totalTemps; i++)
  {
    float t = sensors.getTempCByIndex(i);
    if (abs(t - temps[i].value) > temp_threshold)
    {
      flag = true;
    }
    temps[i].value = t;
  }


  if (flag)
  {
    updateTempDSP();
    if (mqtt_connected)
    {
      DynamicJsonDocument doc(64);
      doc["mac"] = mac;
      doc["event"] = "report";
      JsonArray array1 = doc.createNestedArray("temps");
      for (uint8_t i = 0; i < totalTemps; i++)
      {
        temps[i].value = sensors.getTempCByIndex(i);
        array1.add(temps[i].value);
      }
      String result;
      serializeJson(doc, result);
      Serial.println(result);
      publishReport(result.c_str());
    }
  }

  minCounter = minCounter + 1;



  for (uint8_t i = 0; i < totalOutputs; i++)
  {





    if (outputs[i].timer.length() == 18)
    {
      if (outputs[i].timer.substring(0, 7).indexOf(String(dayOfWeek)) != -1)
      {

        int startH = outputs[i].timer.substring(8, 10).toInt();
        int startM = outputs[i].timer.substring(11, 13).toInt();
        int endH = outputs[i].timer.substring(13, 15).toInt();
        int endM = outputs[i].timer.substring(16, 18).toInt();

        if (hour >= startH)
        {
          if (hour == startH)
          {
            if (minute > startM)
            {
              if (hour <= endH)
              {
                if (hour == endH)
                {
                  if (minute < endM)
                  {

                    switchRelay(i, LOW, 0, false);


                  }
                  else
                  {


                    switchRelay(i, HIGH, 0, false);



                    continue;
                  }
                }
                if (hour < endH)
                {

                  switchRelay(i, LOW, 0, false);




                  continue;
                }
              }
              else
              {

                switchRelay(i, HIGH, 0, false);



              }
            }
            else
            {

              continue;
            }
          }
          else
          {
            if (hour <= endH)
            {
              if (hour == endH)
              {
                if (minute < endM)
                {

                  switchRelay(i, LOW, 0, false);


                }
                else
                {

                  switchRelay(i, HIGH, 0, false);


                  continue;
                }
              }
              if (hour < endH)
              {

                switchRelay(i, LOW, 0, false);


                continue;
              }
            }
            else
            {

              switchRelay(i, HIGH, 0, false);


            }
          }
        }
      }
    }
    else if (outputs[i].timer.length() == 16)
    {

      if ((outputs[i].timer.substring(0, 7).indexOf(String(dayOfWeek)) != -1))
      {

        int perHour = outputs[i].timer.substring(8, 10).toInt();
        int h = outputs[i].timer.substring(11, 13).toInt();
        int m = outputs[i].timer.substring(14, 16).toInt();
        uint t;
        if (perHour <= 0)
        {

          return;
        }
        if (m <= 0)
        {

          return;
        }
        if (24 % perHour == 0)
        {
          t = 24 / perHour;
        }
        else
        {

          return;
        }
        if (h >= perHour)
        {

          return;
        }

        for (int j = 0; j <= t; j++)
        {
          uint8_t cycleStart = (j + 1) * perHour;
          uint8_t cycleEnd = cycleStart + perHour;
          if (hour >= cycleStart && hour < cycleEnd)
          {

            uint16_t onMTime = (h * 60) + m;
            uint16_t passed = ((hour - cycleStart) * 60) + minute;

            if (passed <= onMTime)
            {

              switchRelay(i, LOW, 0, false);
              Serial.print(i + 1);
              Serial.println(" sch is on ");
            }
            else
            {

              switchRelay(i, HIGH, 0, false);
              Serial.print(i + 1);
              Serial.println(" sch is off ");
            }
            break;
          }
        }
      }
    }
    else if (outputs[i].timer.charAt(0) == 't' && toggleTimers[i] != -1)
    {
      int8_t toggle = outputs[i].timer.substring(1).toInt();
      if (toggleTimers[i] == -1)
      {
        Serial.println("check toggle timer");
        Serial.println("toggle time");
        Serial.println(toggle);
        toggleTimers[i] = toggle * 2;
      }
      else
      {
        if (toggleTimers[i] > toggle)
        {
          toggleTimers[i] = toggleTimers[i] - 1;

          switchRelay(i, LOW, 0, false);
          Serial.println("toggleTimers[i] > toggle");
          Serial.println(toggleTimers[i]);
        }
        else if (toggleTimers[i] > 0 && toggleTimers[i] <= toggle)
        {
          toggleTimers[i] = toggleTimers[i] - 1;

          switchRelay(i, HIGH, 0, false);
          Serial.println("toggleTimers[i] <= toggle");
          Serial.println(toggleTimers[i]);
        }
        else if (toggleTimers[i] == 0)
        {
          toggleTimers[i] = toggle * 2;
          Serial.println("toggleTimers[i] == 0");
        }
      }
    }
  }



