hosein282/esp32_relex/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino.cpp
}
int avgIndex = 0;

void setAverageElement()
{
  Serial.println("setAverageElement");

  for (uint8_t i = 0; i < totalAnalogs; i++)
  {
    analogInputs[i].buffer[(minCounter / 10) - 1] = analogInputs[i].voltage;
  }

  for (uint8_t i = 0; i < totalTemps; i++)
  {
    temps[i].buffer[(minCounter / 10) - 1] = temps[i].value;
  }

  currentAmp.buffer[(minCounter / 10) - 1] = currentAmp.value;
}

void createMovingAverage()
{
  Serial.println("createMovingAverage");

  for (uint8_t i = 0; i < totalAnalogs; i++)
  {
    float avg = 0;
    for (int j = 0; j < WINDOW_SIZE; j++)
    {
      avg += analogInputs[i].buffer[j];
    }
    avg /= WINDOW_SIZE;

    analogInputs[i].avg = (int)avg;
    Serial.println("analog avg :");
    Serial.println(avg);
  }

  for (uint8_t i = 0; i < totalTemps; i++)
  {
    float avg = 0;
    for (int j = 0; j < WINDOW_SIZE; j++)
    {
      avg += temps[i].buffer[j];
    }
    avg /= WINDOW_SIZE;

    temps[i].avg = (int)avg;
    Serial.println("temp avg :");
    Serial.println(avg);
  }


  float avg = 0;
  for (int j = 0; j < WINDOW_SIZE; j++)
  {
    avg += currentAmp.buffer[j];
  }
  avg /= WINDOW_SIZE;

  currentAmp.avg = (int)avg;
  Serial.println("current avg :");
  Serial.println(avg);

  if (mqtt_connected)
  {
    String report = prepareDbLog("log");
    publishReport(report.c_str());
  }
}

void saveLastRelayStates()
{







}

void sendMqttFeedback()
{
  if (mqtt_connected)
  {
    StaticJsonDocument<64> doc;

    doc["mac"] = mac;
    doc["event"] = "feedback";
    doc["oSt"] = createOutArray();
    String result;
    serializeJson(doc, result);
    Serial.println(result);
    publishReport(result.c_str());


  }
  updateStatesDSP();
}
void setPwm(uint8_t index, uint8_t percent)
{

  uint8_t value = (percent * (aResolution / 100));
  if (pwms[index].pwm == percent)
  {
    return;
  }

  ledcWrite(index, value);
  pwms[index].pwm = percent;
  if (mqtt_connected)
  {
    StaticJsonDocument<64> doc;
    doc["mac"] = mac;
    doc["event"] = "feedback";
    pwmStates = createPwmArray();
    doc["pwm"] = pwmStates;
    doc.remove("percent");
    String result;
    serializeJson(doc, result);
    Serial.println(result);

    publishReport(result.c_str());
  }
}



void clearTimer(uint8_t index)
{
  writeDateTimeEEPROM(outputs[index].timerKey, "");
  outputs[index].timer = "";
  Serial.print("cleared timer ");
  Serial.println(index);
}
# 4771 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
void doAction(String phoneNumber)
{





  if (msg.indexOf("r") != -1 && msg.length() > 3)
  {
    uint8_t out = msg.substring(1, 2).toInt() - 1;
    boolean state = 0;
    if (msg.substring(2, 4) == "on")
    {
      state = 1;
    }
    else if (msg.substring(2, 4) == "of")
    {
      state = 0;
    }
    else
    {
      return;
    }

    String outPrg = outputIsBusy(out);
    if (!outPrg.isEmpty())
    {
      clearSmsVariables();
      String text = "رله " + String(out + 1) + " قفل و در حالت ";
      text = text + ((outPrg.charAt(0) == 's') ? "دزدگیر قرار دارد" : "پمپ قرار دارد");
      ReplyHex(text, phoneNumber);
      return;
    }

    switchRelay(out, !state, 0, false);



    Serial.print(out + 1);
    Serial.print("is ");
    Serial.println(state == 1 ? "ON" : "OFF");
    String text = "";
    if (outputs[out].label.isEmpty())
    {
      text = "رله " + String(out + 1);
    }
    else
    {
      text = outputs[out].label;
    }

    text = text + ((state) ? " روشن شد " : " خاموش شد ");
    text += "\n";
    for (uint8_t i = 0; i < totalOutputs; i++)
    {
      text += outStates[(i * 2) + 1];
    }

    ReplyHex(text, phoneNumber);
    if (!outputs[out].timer.isEmpty())
    {
      clearTimer(out);
    }
    events.send("refresh", NULL, millis());
  }



  else if (msg.indexOf("l") != -1 && msg.indexOf("=") != -1)
  {
    uint8_t out = (msg.substring(1, 2).toInt()) - 1;
    if (out != -1)
    {
      writeToEEPROM(outputs[out].labelKey, tempLabel);
      outputs[out].label = tempLabel;
      String text = "نام رله " + String(out + 1) + " به " + tempLabel + " تغییر یافت ";
      ReplyHex(text, phoneNumber);
    }
  }


  else if (msg == "labels")
  {
    String text = "نام رله ها:\r\n";
    for (uint8_t i = 0; i < totalOutputs; i++)
    {
      if (!outputs[i].label.isEmpty())
      {
        text = text + String(i + 1) + ": " + (outputs[i].label == "" ? "بی نام" : outputs[i].label) + "\r\n";
      }
    }
    debugPrint(text);
    ReplyHex(text, phoneNumber);
  }

  else if (msg.indexOf("n") != -1 && msg.indexOf("=") != -1)
  {
    uint8_t in = (msg.substring(1, 2).toInt()) - 1;
    if (in != -1)
    {
      writeToEEPROM(inputs[in].labelKey, tempLabel);
      inputs[in].label = tempLabel;
      String text = "نام ورودی " + String(in + 1) + " به " + tempLabel + " تغییر یافت ";
      ReplyHex(text, phoneNumber);
    }
  }



  else if (msg.indexOf("stat=") != -1)
  {
    uint8_t out = msg.substring(msg.indexOf("=")).toInt() - 1;
    String text = "رله" + String(out + 1);

    debugPrint("Relay" + String(out + 1) + " is " + text);
    text = text + (digitalRead(outputs[out].gpio) == LOW) ? "روشن است " : "خاموش است ";
    ReplyHex("Relay 1 is " + text, phoneNumber);
  }

  else if (msg == "stat")
  {
    String text = "";

    for (uint8_t i = 0; i < totalOutputs; i++)
    {
      text = text + String(i + 1) + (digitalRead(outputs[i].gpio) == LOW) ? "_ON\r\n" : "_OFF\r\n";
    }
    debugPrint(text);
    Reply(text, phoneNumber);
  }



  else if (msg.indexOf("p") != -1 && msg.indexOf("=") != -1)
  {
    uint8_t index = (msg.substring(1, 2).toInt()) - 1;
    if (tempPhone.length() == 13 && tempPhone[0] == '+')
    {
      writeToEEPROM(offsetPhone[index], tempPhone);
    }
    else if (tempPhone.length() == 11 && tempPhone[0] == '0')
    {
      tempPhone = "+98" + tempPhone.substring(1);
      writeToEEPROM(offsetPhone[index], tempPhone);
    }
    phoneNo[index] = tempPhone;
    String text = "شماره مدیر " + String(index + 1) + " با موفقیت ثبت شد";
    Serial.println("Number " + String(index + 1) + " is Registered");

