hosein282/esp32_relex/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino.cpp
    ReplyHex(text, phoneNumber);
  }

  else if (msg == "list")
  {
    String text = "لیست کاربران";
    for (uint8_t i = 0; i < totalPhoneNo; i++)
    {
      if (!phoneNo[i].isEmpty())
      {

        String phone = "0" + phoneNo[i].substring(3);
        if (i != (totalPhoneNo - 1))
        {
          text = text + "\r\n";
        }
        text = text + String(i + 1) + "." + phone;
      }
    }
    debugPrint("List of Registered Phone Numbers: \r\n" + text);
    ReplyHex(text, phoneNumber);
  }


  else if (msg.indexOf("del=") != -1)
  {
    uint8_t index = (msg.substring(4, 5).toInt()) - 1;
    writeToEEPROM(offsetPhone[index], "");
    phoneNo[index] = "";

    ReplyHex("شماره کاربر " + String(index + 1) + "با موفقیت پاک شد", phoneNumber);
  }


  else if (msg == "del=all")
  {
    writeToEEPROM(offsetPhone[0], "");
    writeToEEPROM(offsetPhone[1], "");
    writeToEEPROM(offsetPhone[2], "");
    writeToEEPROM(offsetPhone[3], "");
    writeToEEPROM(offsetPhone[4], "");
    phoneNo[0] = "";
    phoneNo[1] = "";
    phoneNo[2] = "";
    phoneNo[3] = "";
    phoneNo[4] = "";
    debugPrint("All phone numbers are deleted.");
    ReplyHex("همه شماره ها پاک شدند", phoneNumber);
  }


  else if (msg.indexOf("t") != -1 && msg.indexOf("=") != -1)
  {
    uint8_t index = (msg.substring(1, 2).toInt()) - 1;
    String outPrg = outputIsBusy(index);
    if (!outPrg.isEmpty())
    {
      String text = "رله " + String(index + 1) + " قفل و در حالت ";
      text = text + ((outPrg.charAt(0) == 's') ? "دزدگیر قرار دارد" : "پمپ قرار دارد");
      ReplyHex(text, phoneNumber);
      return;
    }
    writeDateTimeEEPROM(outputs[index].timerKey, tempSch);
    outputs[index].timer = tempSch;
    String text;
    if (tempSch.length() >= 2 && tempSch.length() < 6 && tempSch.charAt(0) != 't')
    {
      String t;
      if (tempSch.substring(2, 4) == "-")
      {
        bool minus = true;
        t = tempSch.substring(3, 5) + " درجه ";
      }
      else
      {
      }
      t = tempSch.substring(2, 4) + " درجه ";
      if (tempSch.charAt(0) == 'c')
      {
        text = " عملکرد فن رله " + String(index + 1) + " در دمای پایینتر از" + t + " فعال شد";
      }
      else if (tempSch.charAt(0) == 'h')
      {
        text = " عملکرد هیتر رله " + String(index + 1) + " در دمای بالاتر از" + t + " فعال شد";
      }
    }
    else
    {
      text = "تایمر رله " + String(index + 1) + " فعال شد";
    }
    if (outputs[index].timer.charAt(0) == 't')
    {
      int8_t toggle = outputs[index].timer.substring(1).toInt();
      toggleTimers[index] = toggle * 2;
    }
    else
    {
      toggleTimers[index] = -1;
    }

    ReplyHex(text, phoneNumber);
    debugPrint("Relay " + String(index + 1) + " is Set :");
    debugPrint(tempSch);
  }



  else if (msg.indexOf("s") != -1 && msg.indexOf("=") != -1)
  {
    uint8_t in = (msg.substring(1, 2).toInt()) - 1;
    String text = addScenario(tempSch);
    if (text != "")
    {
      ReplyHex(text, phoneNumber);
    }
    debugPrint("Input " + String(in + 1) + " is Set :");
    debugPrint(tempSch);
  }


  else if (msg.indexOf("s") != -1 && msg.indexOf("x") != -1)
  {
    uint8_t in = (msg.substring(1, 2).toInt()) - 1;
    writeDateTimeEEPROM(scenarios[in].key, "");
    scenarios[in].value = "";
    String text = "برنامه ورودی " + String(in + 1) + " پاک شد ";
    ReplyHex(text, phoneNumber);
    debugPrint("Input " + String(in + 1) + " prg deleted.");
  }
  else if (msg == "set")
  {





    String text =
        "setting : " + String(callOnAlert) + "," + String(securityMode) + "," + String(notifyScenarios) + "," + String(remoteCount);

    ReplyHex(text, phoneNumber);
  }

  else if (msg.indexOf("t") != -1 && msg.indexOf("x") != -1)
  {
    uint8_t out = (msg.substring(1, 2).toInt()) - 1;
    writeDateTimeEEPROM(outputs[out].timerKey, "");
    outputs[out].timer = "";
    toggleTimers[out] = -1;

    String text = " عملکرد رله" + String(out + 1) + " پاک شد ";
    ReplyHex(text, phoneNumber);
    debugPrint("Relay " + String(out + 1) + " Sch deleted.");
    checkTasks();
  }
  else if (msg == "sch")
  {
    String text = "لیست عملکرد رله ها: \r\n";
    for (uint8_t i = 0; i < totalOutputs; i++)
    {
      if (!outputs[i].timer.isEmpty())
      {
        text = text + String(i + 1) + ": " + (outputs[i].timer == "" ? "ساده" : outputs[i].timer) + "\r\n";
      }
    }
    debugPrint("List of Schedules: \r\n" + text);
    ReplyHex(text, phoneNumber);
  }
  else if (msg == "temp")
  {
    String text = "دمای فعلی :";
    text = text + "\r\n";
    sensors.requestTemperatures();

    for (uint8_t i = 0; i < totalTemps; i++)
    {
      temps[i].value = sensors.getTempCByIndex(i);
      text = text + String(temps[i].value) + "ºC" + "\r\n";
    }






    ReplyHex(text, phoneNumber);
    debugPrint(msg);
  }


  else if (msg == "son")
  {
# 5125 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
  }
  else if (msg == "soff")
  {
# 5147 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
  }
  else if (msg == "balance")
  {
    Serial.println("Charge Message Recieved!");
    Serial.println(msg);
    if (op == "mci")
    {
      Serial2.println(TCI_CHARGE);
    }
    else if (op == "irancell")
    {
      Serial2.println(IRANCEL_CHARGE);
    }
  }

  else if (msg == "non")
  {
    notifyScenarios = true;
    String text = "اعلام روشن شدن دستگاه، فعال شد";
    ReplyHex(text, phoneNumber);
  }
  else if (msg == "noff")
  {
    notifyScenarios = false;
    String text = "اعلام روشن شدن دستگاه، خاموش شد";
    ReplyHex(text, phoneNumber);
  }

  else if (msg == "poff")
  {
# 5192 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
  }
  else if (msg == "wipe")
  {

    Serial.println("restet called");
    EEPROM.clear();

    removeAllRemotes();
    resetWifi();
    String text = "دستگاه ریست و حافظه پاک شد ";
    ReplyHex(text, phoneNumber);
    ESP.restart();
  }

  else if (msg == "dr")
  {
    Serial.print("Remote Saved!");

    removeAllRemotes();
    String text = "همه ریموت ها پاک شدند";
    ReplyHex(text, phoneNumber);
  }

  else if (msg == "calloff")
  {
    callOnAlert = false;
    String text = "تماس تلفنی غیرفعال شد";
    ReplyHex(text, phoneNumber);
  }
  else if (msg == "callon")
  {
    callOnAlert = true;
    String text = "تماس تلفنی فعال شد";
    ReplyHex(text, phoneNumber);
  }

