hosein282/esp32_relex/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino.cpp
  clearSmsVariables();
}

void clearSmsVariables()
{
  smsStatus = "";
  receivedDate = "";
  msg = "";
  tempPhone = "";
  tempSch = "";
  tempLabel = "";
}

String outputIsBusy(uint8_t index)
{
# 5251 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
  return "";
}





void Reply(String text, String Phone)
{
  SendShortCommand("AT+CMGF=1", "");


  if (op == "irancell")
  {
    SendShortCommand("AT+CSMP=17,167,0,0", "");


  }
  SendShortCommand("AT+CMGS=\"" + Phone + "\"", "");


  SendShortCommand(text, "");

  delay(100);
  Serial2.write(0x1A);


  Serial.println("SMS Sent Successfully.");
  receiveSms();
}

void ReplyHex(String text, String Phone)
{
  char charArray[160];
  text.toCharArray(charArray, 160);
  String hexString = printCodePoints((uint8_t *)charArray);


  SendShortCommand("AT+CMGF=1", "");



  SendShortCommand("AT+CSCS=\"HEX\"", "");


  SendShortCommand("AT+CSMP=17,167,0,8", "");




  SendShortCommand("AT+CMGS=\"" + Phone + "\"", "");


  SendShortCommand(hexString, "");

  delay(100);
  Serial2.write(0x1A);


  Serial.println("SMS Sent Successfully.");
  receiveSms();
}

void ForwardHex(String text, String Phone)
{

  Serial2.print("AT+CMGF=1\r");
  delay(1000);

  Serial2.print("AT+CSCS=\"HEX\"\r");
  delay(1000);


  Serial2.println("AT+CSMP=17,167,0,8");
  delay(1000);

  Serial2.print("AT+CMGS=\"" + Phone + "\"\r");
  delay(1000);
  Serial2.print(text);
  delay(100);
  Serial2.write(0x1A);

  delay(3000);

  Serial.println("SMS Sent Successfully.");
  receiveSms();
}

void callAdmin(int index)
{
  Scenario scenario = scenarios[index];
  if (millis() - scenario.lastNotif > 5 * 60000)
  {
    scenarios[index].lastNotif = millis();
    Serial2.println("ATD+ " + phoneNo[0] + ";");
    addTask(hangUp, 20000);
  }
}

void hangUp()
{
  Serial2.println("ATH");
}

void answerCall()
{
  Serial2.println("ATA");
}





void writeToEEPROM(const char *addrOffset, const String &strToWrite)
{



  EEPROM.putString(addrOffset, strToWrite);



}
void writeIntToEEPROM(const char *addrOffset, unsigned int value)
{

  EEPROM.putUInt(addrOffset, value);
}

void writeDateTimeEEPROM(const char *addrOffset, const String &strToWrite)
{
  EEPROM.putString(addrOffset, strToWrite);
}





String readFromEEPROM(const char *addrOffset)
{
  String value = EEPROM.getString(addrOffset);
  return value;
}
int readIntFromEEPROM(const char *addrOffset)
{
  return EEPROM.getUInt(addrOffset, 0);
}





boolean comparePhone(String number)
{
  boolean flag = 0;

  for (uint8_t i = 0; i < totalPhoneNo; i++)
  {
    phoneNo[i] = readFromEEPROM(offsetPhone[i]);
    if (phoneNo[i].equals(number))
    {
      flag = 1;
      break;
    }
  }


  return flag;
}

void flip()
{



  ++count;

  if (count == 10)
  {
    flipper.attach(0.1, flip);
  }

  else if (count == 60)
  {
    flipper.detach();
  }
}





void debugPrint(String text)
{
  if (DEBUG_MODE == 1)
  {
    Serial.println(text);
  }
}

String createOutArray()
{
  String result = "";
  for (uint8_t i = 0; i < totalOutputs; i++)
  {
    result += String(outputs[i].type);
    result += (digitalRead(outputs[i].gpio)) ? '0' : '1';



  };
  outStates = result;
  return result;
}

String createPwmArray()
{
  String result = "";
  for (uint8_t i = 0; i < totalPwm; i++)
  {
    result += pwms[i].pwm;
    if (i < (totalPwm - 1))
    {
      result += ",";
    }
  };
  pwmStates = result;
  return result;
}

String createInArray()
{
  String result = "";
  for (uint8_t i = 0; i < totalInputs; i++)
  {
    result += (digitalRead(inputs[i].gpio)) ? '1' : '0';



  };
  inStates = result;

  return result;
}

String createSettingArray()
{
  String result = "";
  result += callOnAlert ? '1' : '0';
  result += securityMode ? '1' : '0';
  result += notifyScenarios ? '1' : '0';
  result += hasWifi ? '1' : '0';
  result += hasGSM ? '1' : '0';
  result += forceUseGprs ? '1' : '0';
  return result;
}

String prepareData()
{
  StaticJsonDocument<512> doc;

  doc["nt"] = op;
  doc["sig"] = signalQuality;
  doc["date"] = rtc.getEpoch();

  for (uint8_t i = 0; i < totalOutputs; i++)
  {
    JsonObject temp = doc.createNestedObject(String(i));
    temp["name"] = (outputs[i].label.isEmpty()) ? "Relay " + String(i + 1) : outputs[i].label;
    temp["timer"] = (outputs[i].timer.isEmpty()) ? "" : outputs[i].timer;
    temp["state"] = (digitalRead(outputs[i].gpio)) ? 0 : 1;
  };





  doc["net"] = mqttNet;

  doc["sets"] = createSettingArray();
  doc["progs"] = createScenariosArray();

  doc["iSt"] = createInArray();
  doc["pwm"] = createPwmArray();

  sensors.requestTemperatures();

  JsonArray array1 = doc.createNestedArray("temps");
  for (uint8_t i = 0; i < totalTemps; i++)
  {
    temps[i].value = sensors.getTempCByIndex(i);
    array1.add(temps[i].value);
  }
  JsonArray array2 = doc.createNestedArray("ain");

  for (uint8_t i = 0; i < totalAnalogs; i++)
  {
    array2.add(analogInputs[i].voltage);
  }
  String result;
  serializeJson(doc, result);
  Serial.print(result);
  return result;
}

String mqttPeresence()
{
  StaticJsonDocument<64> doc;
  doc["mac"] = mac;

  doc["event"] = "report";
  doc["oSt"] = outStates;
  doc["iSt"] = inStates;
  doc["pwm"] = pwmStates;

  unsigned char unsignedCharArray[164];


  serializeJson(doc, unsignedCharArray, 164);




  unsigned char base64[164];

  unsigned int base64_length = encode_base64(unsignedCharArray, strlen((char *)unsignedCharArray), base64);
  Serial.println(String((const char *)base64));
  return String((const char *)base64);
}

String createTimersArray()
{
  String str;
  for (uint8_t i = 0; i < totalOutputs; i++)
  {
    if (outputs[i].timer.length() > 0)
    {
      str += outputs[i].timer;
    }
    else
    {
      str += "-";
    }
    if (i < (totalOutputs - 1))
    {
      str += ",";
    }
  }
  Serial.println(str);
  return str;
}
String createScenariosArray()
{
  String str = "";
  for (uint8_t i = 0; i < scenariosCount; i++)
  {
    if (scenarios[i].value.length() > 0)
    {
      str += scenarios[i].value;
      str += ":s";
      str += String(i + 1);
    }
    if (i < (scenariosCount - 1))
    {
      str += ",";
    }
  }

  return str;
}

String createChainsArray()
{
  String str = "";
  for (uint8_t i = 0; i < totalOutputs; i++)
  {

