hosein282/esp32_relex/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino.cpp
    if (outputs[i].chain)
    {
      for (int v = 0; v < totalOutputs; v++)
      {
        str += String(outputs[i].chain[v]);

        if (v < totalOutputs - 1)
        {
          str += ":";
        }
      }
      if (i < (totalOutputs - 1))
      {
        str += ",";
      }
    }
  }

  return str;
}

String prepareDbData(String event)
{

  StaticJsonDocument<512> doc;

  doc["op"] = op;
  doc["sig"] = String(signalQuality);

  doc["mac"] = mac;
  doc["event"] = event;

  doc["net"] = mqttNet;

  doc["sets"] = createSettingArray();
  doc["tims"] = createTimersArray();
  doc["progs"] = createScenariosArray();


  doc["oSt"] = createOutArray();
  doc["iSt"] = createInArray();
  doc["pwm"] = createPwmArray();
  doc["curr"] = currentAmp.value;
  sensors.requestTemperatures();

  JsonArray array1 = doc.createNestedArray("temps");
  for (uint8_t i = 0; i < totalTemps; i++)
  {
    temps[i].value = sensors.getTempCByIndex(i);
    array1.add(temps[i].value);
  }
  JsonArray array2 = doc.createNestedArray("ain");

  for (uint8_t i = 0; i < totalAnalogs; i++)
  {
    array2.add(analogInputs[i].voltage);
  }

  String result;
  serializeJson(doc, result);
  Serial.println(result);

  return result;
}

String prepareDbLog(String event)
{

  StaticJsonDocument<512> doc;

  doc["op"] = op;
  doc["sig"] = String(signalQuality);

  doc["mac"] = mac;
  doc["event"] = event;
  doc["net"] = mqttNet;

  doc["oSt"] = createOutArray();
  doc["iSt"] = createInArray();
  doc["pwm"] = createPwmArray();
  doc["curr"] = currentAmp.avg;

  JsonArray array1 = doc.createNestedArray("temps");
  for (uint8_t i = 0; i < totalTemps; i++)
  {
    array1.add(temps[i].avg);
  }
  JsonArray array2 = doc.createNestedArray("ain");

  for (uint8_t i = 0; i < totalAnalogs; i++)
  {
    array2.add(analogInputs[i].avg);
  }

  String result;
  serializeJson(doc, result);
  Serial.println(result);

  return result;
}

String prepareTimersData()
{
  StaticJsonDocument<256> doc;
  sensors.requestTemperatures();

  doc["mac"] = mac;
  doc["event"] = "report";
  doc["timers"] = createTimersArray();
  doc["progs"] = createScenariosArray();

  String result;
  serializeJson(doc, result);
  Serial.println(result);

  return result;
}

String prepareSync()
{
  StaticJsonDocument<256> doc;
  doc["mac"] = "macString";
  String result;
  serializeJson(doc, result);
  return result;
}

String prepareSMSStats()
{
  esp_task_wdt_reset();

  String text = "";
  for (int i = 0; i < totalOutputs; i++)
  {
    String temp;
    if (outputs[i].label.isEmpty())
    {
      temp = temp + "r" + String(i + 1) + "-";
    }
    else
    {
      temp = temp + outputs[i].label + "-";
    }
    if (outputs[i].timer.isEmpty())
    {
      temp = temp + "t" + "-";
    }
    else
    {
      temp = temp + outputs[i].timer + "-";
    }
    if (scenarios[i].value.isEmpty())
    {
      temp = temp + "i" + "-";
    }
    else
    {
      temp = temp + scenarios[i].value + "-";
    }
    if (digitalRead(outputs[i].gpio))
    {
      temp = temp + 0;
    }
    else
    {
      temp = temp + 1;
    }
    temp = temp + "=";
    if (i != 3)
    {
    }
    text = text + temp;
    Serial.println(temp);
  };
  sensors.requestTemperatures();


  for (uint8_t i = 0; i < totalTemps; i++)
  {
    temps[i].value = sensors.getTempCByIndex(i);
    text = text + String(temps[i].value) + "/";
  }
  text = text + String(temps[0].value) + "/";
  text = text + op + "/";
  text = text + String(signalQuality) + "/";
  text = text + String(callOnAlert) + "/" + String(securityMode) + "/" + String(notifyScenarios) + "/" + String(remoteCount);

  return text;
  Serial.println(text);
}

void checkUpdate(String firmwareUrl)
{
  WiFiClient client;




  client.setTimeout(12000);
# 5835 "C:/Users/Amin/Documents/PlatformIO/Projects/250408-163529-esp32doit-devkit-v1/src/esp32_wifi_gsm_littlefs_node_red_scenario_last.ino"
  httpUpdate.onProgress(update_progress);

  t_httpUpdate_return ret = httpUpdate.update(client, firmwareUrl, "", [](HTTPClient *client)
                                              {

                                              });


  StaticJsonDocument<256> doc;
  doc["event"] = "feedback";
  doc["mac"] = mac;

  String result;

  switch (ret)
  {
  case HTTP_UPDATE_FAILED:
    Serial.printf("HTTP_UPDATE_FAILED Error (%d): %s\n", httpUpdate.getLastError(), httpUpdate.getLastErrorString().c_str());
    doc["update"] = "failed";
    serializeJson(doc, result);
    publishReport(result.c_str());

    Serial.println("HTTP_UPDATE_OK");
    break;
  case HTTP_UPDATE_NO_UPDATES:
    Serial.println("HTTP_UPDATE_NO_UPDATES");
    doc["update"] = "already updated!";
    serializeJson(doc, result);
    publishReport(result.c_str());

    Serial.println("HTTP_UPDATE_OK");
    break;

  case HTTP_UPDATE_OK:
    doc["update"] = "succes";
    serializeJson(doc, result);
    publishReport(result.c_str());

    Serial.println("HTTP_UPDATE_OK");
    break;
  }
}

void update_progress(int cur, int total)
{
  Serial.printf("CALLBACK:  HTTP update process at %d of %d bytes...\n", cur, total);
  int p = (cur * 100) / total;
  loadingDisplay(cur, "Updating");
}

String arrayToString(int arr[])
{
  String result = "";
  for (int i = 0; i < totalOutputs; i++)
  {
    result += String(arr[i]);
    if (i < totalOutputs - 1)
    {
      result += ",";
    }
  }
  return result;
}


void stringToArray(String str, int arr[])
{
  int index = 0;
  int start = 0;
  int end = str.indexOf(',');

  while (end != -1 && index < totalOutputs)
  {
    arr[index++] = str.substring(start, end).toInt();
    start = end + 1;
    end = str.indexOf(',', start);
  }

  if (index < totalOutputs)
  {
    arr[index] = str.substring(start).toInt();
  }
}